{
	"name": "AssetBackedSecurityType",
	"properties": {
		"Namespace": {
			"DatabaseName": "banking"
		},
		"Name": "AssetBackedSecurityType",
		"Description": "A type of asset backed security.\n\nEx.:\n- Asset Backed Security\n- Mortgage Backed Security\n\nwhere:\n\nASSET BACKED SECURITY\nAsset-backed securities represent securitized interests in a pool of assets. Issues have been backed by credit card receivables, auto loans and other forms of consumer installment loans. \n\nA security backed by notes or receivables against assets other than real estate. \n\nInvestors receive monthly payments of principal and interest. Securities backed by installment loans operate much like a mortgage pass-through. All principal and interest payments flow directly to investors. \n\nEx:\nCREDIT CARD RECEIVABLES (\"CARDS\")\nDebt instrument collateralized by automobile loan paper .\n\nCredit card debt is known as revolving debt and is a key influence on the structure of credit card ABS.  Credit cardholders are assigned a credit limit and can generally borrow funds up to that amount. They can repay some or all of their debt at any time, and can take on additional debt as long as the total debt is within their credit limit. Cardholders can repay as little or as much principal each month as they desire, subject to a small minimum payment. Thus, there is no true maturity for a credit card account and the amount of principal or loan may fluctuate over time.\n\nThe collateral for a credit card security is the outstanding debt (the receivables) of a group, or pool, of individual credit card accounts. The cash flow available to pay interest to investors comes from the pool's gross revenues, which is made up of finance charges, annual fees, late charges, and interchange (the fee paid to the credit card issuer by a merchant who makes a sale charged to the card). Expenses for the pool consist of the ABS coupon, charge-offs, and a servicing fee.\n\nAn issuer creates a credit card security by first setting up a trust. Then, the issuer sells the outstanding receivables (the current balances and the future cash flows produced by the current balances) of a designated group of credit card accounts to the trust. Additionally, the issuer transfers the right to purchase, at par, any future balances generated by the same group of accounts. The balance of receivables outstanding is collateralized into two types of securities, known as investor and seller certificates. The investor certificate is sold to ABS investors and the seller certificate is retained by the card issuer. The holder of the seller certificate receives all finance charge cash flows from the receivables that remain after payment of the investor certificate coupon, the collateral pool servicing fee, charge-offs, and trust expenses. The balance of the seller certificate fluctuates over time as cardholders pay off their balances and make new purchases. The cash flow available to pay the investor coupon depends on the amount of principal outstanding. If the pool's principal is paid down more quickly than new charges are added to the point where the balance falls below an established minimum, the seller must add more accounts to the pool.\n\nAUTOMOBILE LOANS (\"CARS\")\nDebt instrument collateralized by automobile loan paper .\n\nABS backed by automobile loans were the first major sector of the market. Automobile loans are the most straightforward type of collateral used for ABS. They generally have 6 or fewer years to maturity, are fully amortizing, and are collateralized by the automobile. Initial loan-to-value (LTV) ratios are usually 80%-90%. \n\nMost prepayments on auto loans result from trade-ins or defaults. Refinancings are almost nonexistent because loan rates are significantly higher for used autos than new ones (a loan from a refinancing would be considered a used car loan). \n\nAs a result, prepayments are stable and are little affected by the level of interest rates. Compared to unsecured loans such as credit cards, defaults on auto loans are low as cars are almost a necessity and borrowers see the loss of a car through repossession as a substantial burden.\n\nIssuance of an auto ABS begins with the creation of a special purpose trust to hold collateral on behalf of investors and to administer the distribution of cash flows. Automobile ABS can be structured in a number of ways, with a pro rata pass-through payment structure being the most common. However, since auto loans amortize over time, principal cash flows are more widely distributed than is desired by many investors who prefer short principal repayment periods. This has led to the tranching of auto ABS, similar to CMOs in the mortgage-backed securities sector. Thus, deals may include PAC tranches that are targeted to investors who want virtual certainty of cash flow, along with support tranches that offer a higher yield in return for greater cash flow uncertainty. However, the average life variability of support tranches for such deals is much less than that for CMOs.\n\nAutomobile ABS credit quality is generally quite high and loan loss rates have been very low. A \"prime pool\" of auto loans is characterized by relatively conservative underwriting standards, new vehicles backing the notes, maturities of less than 5 years, and an originator who has a record of low delinquency and loss performance. Additional credit enhancements are required to support transactions deviating from the prime pool characteristics. The most common credit enhancements for auto ABS are excess spread protection, subordination, reserve funds, and surety bonds.\n\nCARDS\nSecuritized credit card debt.\n\nSTUDENT LOANS (\"SLABS\")\nABS collateralized by student loans (\"SLABS\") comprise one of the four (along with home equity loans, auto loans and credit card receivables) core asset classes financed through asset-backed securitizations and are a benchmark subsector for most floating rate indices. Federal Family Education Loan Program (FFELP) loans are the most common form of student loans and are guaranteed by the U.S. Department of Education (\"DOE\") at rates ranging from 95%-98% (if the student loan is serviced by a servicer designated as an \"exceptional performer\" by the DOE the reimbursement rate was up to 100%). As a result, performance (other than high cohort default rates in the late 1980's) has historically been very good and investors rate of return has been excellent. The College Cost Reduction and Access Act became effective on October 1, 2007 and significantly changed the economics for FFELP loans; lender special allowance payments were reduced, the exceptional performer designation was revoked, lender insurance rates were reduced, and the lender paid origination fees were doubled.\nA second, and faster growing, portion of the student loan market consists of non-FFELP or private student loans. Though borrowing limits on certain types of FFELP loans were slightly increased by the student loan bill referenced above, essentially static borrowing limits for FFELP loans and increasing tuition are driving students to search for alternative lenders. Students utilize private loans to bridge the gap between amounts that can be borrowed through federal programs and the remaining costs of education[2].\nThe United States Congress created the Student Loan Marketing Association (Sallie Mae) as a government sponsored enterprise to purchase student loans in the secondary market and to securitize pools of student loans. Since its first issuance in 1995, Sallie Mae is now the major issuer of SLABS and its issues are viewed as the benchmark issues.\n\nHOME EQUITY LOANS\nSecurities collateralized by home equity loans (HELs) are currently the largest asset class within the ABS market. Investors typically refer to HELs as any nonagency loans that do not fit into either the jumbo or alt-A loan categories. While early HELs were mostly second lien subprime mortgages, first-lien loans now make up the majority of issuance. Subprime mortgage borrowers have a less than perfect credit history and are required to pay interest rates higher than what would be available to a typical agency borrower. In addition to first and second-lien loans, other HE loans can consist of high loan to value (LTV) loans, re-performing loans, scratch and dent loans, or open-ended home equity lines of credit (HELOC),which homeowners use as a method to consolidate debt. [2]\n\nEQUIPMENT LEASES\nABS collateralized by equipment leases.\n\nTRADE RECEIVABLES\nABS collateralized by trade receivables.\n\nAIRCRAFT LEASES\nABS collateralized by aircraft leases.\n\nMORTGAGE BACKED SECURITY\nMortgage-backed securities are sometimes called \"mortgage pass-through certificates.\"  Mortgage-backed securities pass  through to investors, at a specific coupon, the principal and interest scheduled for payment each month from mortgagors on the outstanding balance of the loans backing the security, and any unscheduled prepayments.\n\nAn investment instrument that represents ownership of an undivided interest in a group of mortgages. Principal and interest from the individual mortgages are used to pay principal and interest on the MBS.\n\nEx:\nCOLLATERALIZED MORTGAGE OBLIGATION (CMO)\nWhile pass-throughs are the primary mechanism for securitization, collateralized mortgage obligations (CMO) is another vehicle for securitizing financial institution assets.    The CMO repackages the cash flows from mortgages and pass-through securities in a different manner.\n\nA pass-through security gives each investor a pro rata share of any interest and principal cash flows on a mortgage pool.   By contrast, a CMO can be viewed as a multi-class pass-through with a number of different bond holder classes or tranches.    Unlike a pass-through, which has no guaranteed annual coupon, each bond holder class in a CMO has a different guaranteed coupon that is paid semi-annually like a T-bond.   The allocation of any excess cash flows over and above the guaranteed coupon payments due to increased mortgage prepayments go toward retiring the principal outstanding of only one class of bond holders, which leaves the other classes prepayment protected for a period of time.\n\nCMOs give investors greater control over the maturity of the mortgage-backed securities that they buy.    Pass-through security holders have a highly uncertain maturity date due to the risk of rapid prepayments.   \n\nCMOs can be created either by packaging and securitizing whole mortgage loans or resecuritizing pass-through securities.\n\nINTEREST/PRINCIPAL-ONLY STRIP\nIn a stripped mortgage-backed security, principal and interest are divided among the classes unequally. For example, one class may be entitled to receive all the principal and the other class all the interest, which is the most common type of stripped mortgage-backed security. \n\nInvestors who anticipate prepayments slowing may prefer the interest-only, or IO, class, which counts on principal being outstanding so that interest can be paid on it. Investors who anticipate prepayments rising may prefer the principal-only (PO) class.  \n\nLike zero coupon bonds, PO securities are purchased at a substantial discount from face, or par, value. The return an investor realizes depends on the speed at which prepayments are made, the faster the better.\n\nMORTGAGE BACKED BOND\nMortgage Back Bonds (MBB) differ from pass-throughs and CMOs in two key ways.\n\n(1) MBBs remain on the balance sheet, whereas pass-throughs and CMOs help remove mortgages from the financial institution balance sheet.\n\n(2) The cash flow on the mortgages backing the bond are non necessarily directly connected to interest and principal payments on the MBB.\n\nThe financial institution issues a MBB to raise long-term low-cost funds.\n\nThe financial institution segregates a group of mortgage assets on the balance sheet and pledges this group of assets as collateral against the MBB issue.\n\nMORTGAGE BACKED SECURITY\nFixed-income securities backed by pools of mortgage loans.\n\nMORTGAGE PASS-THROUGH IO STRIP\nThe mortgage pass-through strip is a special type of CMO with two classes of securities.   The fully-amortized nature of mortgages means that any given monthly payment contains an interest component and a principal component.   \n\nThe owner of an IO Strip has a claim to the interest payments made by the mortgage holder in the GNMA pool, which is to the IO components of each month's cash flows received from the underlying mortgage pool.  \n\nAn IO strip has no par value.   If interest rates decrease, the value of the IO strip increases.   However, the IO investor receives interest only on the amount of the outstanding principal.\n\nMORTGAGE PASS-THROUGH PO STRIP\nThe mortgage pass-through strip is a special type of CMO with two classes of securities.   The fully-amortized nature of mortgages means that any given monthly payment contains an interest component and a principal component.   \n\nThe PO Strip represents the mortgage principal component in each monthly payment by the mortgage holder.   This includes both the scheduled monthly amortized principal component and any prepayments of principal by the mortgage holder.\n\nPARTICIPATION CERTIFICATE\nThe most basic mortgage securities, known as \"pass-throughs,\" or participation certificates (PCs), represent a direct ownership interest in a pool of mortgage loans. These mortgage securities may be pooled again to create collateral for a more complex type of mortgage security known as a Collateralized Mortgage Obligation (CMO).\n\nREMIC\nCMOs and REMICs (terms which are often used interchangeably) are similar types of securities which allow cash flows to be directed so that different classes of securities with different maturities and coupons can be created. They may be collateralized by mortgage loans as well as securitized pools of loans.\n\nA tax entity that issues multiple classes of investor interests (securities) backed by a pool of mortgages.\n\nA security that represents a beneficial interest in a trust having multiple classes of securities. The securities of each class entitle investors to cash flows structured differently from the payments on the underlying mortgages.\n\nPASS-THROUGH MORTGAGE (\"Participation Certificate\")\nFinancial institutions often pool mortgages and other assets that they originate and offer investors an interest in the pool in the form of pass-through certificates or securities.    \n\nThe simplest form of MBS is a mortgage pass-through. With this structure, all principal and interest payments (less a servicing fee) from the pool of mortgages are passed directly to investors each month. \n\nThe most basic mortgage securities, known as \"pass-throughs,\" or participation certificates (PCs), represent a direct ownership interest in a pool of mortgage loans. \n\nThese mortgage securities may be pooled again to create collateral for a more complex type of mortgage security known as a Collateralized Mortgage Obligation (CMO).\n\nEach pass-through mortgage security represents a fractional ownership share in the mortgage pool.\n\nPLANNED AMORTIZATION CLASSES (PACS)\nWhereas in a sequential-pay structure one class receives all the principal payments first (including the prepayments), in a PAC one class receives only the prepayments first. Take the same $100,000 pool of mortgages divided evenly into two classes. Both classes would receive monthly interest and principal payments, but any prepayments would go to Class B (until its principal payments and prepayments reach $50,000 and the bond is retired). Thus, Class B absorbs all the initial prepayment risk and, as a premium to investors incurring this higher risk, Class B offers a higher yield.\n\nREAL ESTATE MORTGAGE INVESTMENT CONDUIT (REMIC)\nA security that represents a beneficial interest in a trust having multiple classes of securities. The securities of each class entitle investors to cash flows structured differently from the payments on the underlying mortgages.\n\nZ BONDS\nIn this structure, one of the classes - the one issued a Z bond -- receives no initial interest or principal payments until the class or classes preceding it are fully paid. The Z bond resembles a zero-coupon bond -- a bond that doesn't pay a regular coupon (or interest payment) but rather is purchased at a discount to what it will pay at maturity. Though Z bondholders don't necessarily have to wait until maturity to receive income, they (like investors in zero coupon bonds) have a long period without any reinvestment risk. Z bonds also minimize the prepayment risk, passing it on to the other classes.",
		"EntityType": "TABLE",
		"TableType": "EXTERNAL",
		"Origin": {
			"Type": "SPARK"
		},
		"StorageDescriptor": {
			"Columns": [
				{
					"Name": "AssetBackedSecurityTypeId",
					"Description": "The unique identifier of an Asset Backed Security Type.",
					"BaseAttributeReference": {
						"Entity": "AssetBackedSecurityType.cdm.json/AssetBackedSecurityType",
						"Name": "AssetBackedSecurityTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "AssetBackedSecurityTypeName",
					"Description": "The name of an Asset Backed Security Type.",
					"BaseAttributeReference": {
						"Entity": "AssetBackedSecurityType.cdm.json/AssetBackedSecurityType",
						"Name": "AssetBackedSecurityTypeName"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 128,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "AssetBackedSecurityTypeDescription",
					"Description": "The description of an Asset Backed Security Type.",
					"BaseAttributeReference": {
						"Entity": "AssetBackedSecurityType.cdm.json/AssetBackedSecurityType",
						"Name": "AssetBackedSecurityTypeDescription"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 512,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				}
			],
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://dpu@adlsgen2deepu.dfs.core.windows.net/dpu_json_test/AssetBackedSecurityType",
					"delimiter": ",",
					"multiLine": "false",
					"firstRowAsHeader": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://dpu@adlsgen2deepu.dfs.core.windows.net/dpu_json_test/AssetBackedSecurityType",
				"Properties": {
					"LinkedServiceName": "wspc-dpu-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "{\"type\":\"None\",\"level\":\"optimal\"}",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"AssetBackedSecurityTypeId\":{\"entity\":\"AssetBackedSecurityType.cdm.json/AssetBackedSecurityType\",\"name\":\"AssetBackedSecurityTypeId\"},\"AssetBackedSecurityTypeName\":{\"entity\":\"AssetBackedSecurityType.cdm.json/AssetBackedSecurityType\",\"name\":\"AssetBackedSecurityTypeName\"},\"AssetBackedSecurityTypeDescription\":{\"entity\":\"AssetBackedSecurityType.cdm.json/AssetBackedSecurityType\",\"name\":\"AssetBackedSecurityTypeDescription\"}}}"
			},
			"Compressed": false,
			"IsStoredAsSubdirectories": false
		},
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"AssetBackedSecurityType\",\"path\":\"AssetBackedSecurityType.cdm.json/AssetBackedSecurityType\"},\"description\":\"A type of asset backed security.\\n\\nEx.:\\n- Asset Backed Security\\n- Mortgage Backed Security\\n\\nwhere:\\n\\nASSET BACKED SECURITY\\nAsset-backed securities represent securitized interests in a pool of assets. Issues have been backed by credit card receivables, auto loans and other forms of consumer installment loans. \\n\\nA security backed by notes or receivables against assets other than real estate. \\n\\nInvestors receive monthly payments of principal and interest. Securities backed by installment loans operate much like a mortgage pass-through. All principal and interest payments flow directly to investors. \\n\\nEx:\\nCREDIT CARD RECEIVABLES (\\\"CARDS\\\")\\nDebt instrument collateralized by automobile loan paper .\\n\\nCredit card debt is known as revolving debt and is a key influence on the structure of credit card ABS.  Credit cardholders are assigned a credit limit and can generally borrow funds up to that amount. They can repay some or all of their debt at any time, and can take on additional debt as long as the total debt is within their credit limit. Cardholders can repay as little or as much principal each month as they desire, subject to a small minimum payment. Thus, there is no true maturity for a credit card account and the amount of principal or loan may fluctuate over time.\\n\\nThe collateral for a credit card security is the outstanding debt (the receivables) of a group, or pool, of individual credit card accounts. The cash flow available to pay interest to investors comes from the pool's gross revenues, which is made up of finance charges, annual fees, late charges, and interchange (the fee paid to the credit card issuer by a merchant who makes a sale charged to the card). Expenses for the pool consist of the ABS coupon, charge-offs, and a servicing fee.\\n\\nAn issuer creates a credit card security by first setting up a trust. Then, the issuer sells the outstanding receivables (the current balances and the future cash flows produced by the current balances) of a designated group of credit card accounts to the trust. Additionally, the issuer transfers the right to purchase, at par, any future balances generated by the same group of accounts. The balance of receivables outstanding is collateralized into two types of securities, known as investor and seller certificates. The investor certificate is sold to ABS investors and the seller certificate is retained by the card issuer. The holder of the seller certificate receives all finance charge cash flows from the receivables that remain after payment of the investor certificate coupon, the collateral pool servicing fee, charge-offs, and trust expenses. The balance of the seller certificate fluctuates over time as cardholders pay off their balances and make new purchases. The cash flow available to pay the investor coupon depends on the amount of principal outstanding. If the pool's principal is paid down more quickly than new charges are added to the point where the balance falls below an established minimum, the seller must add more accounts to the pool.\\n\\nAUTOMOBILE LOANS (\\\"CARS\\\")\\nDebt instrument collateralized by automobile loan paper .\\n\\nABS backed by automobile loans were the first major sector of the market. Automobile loans are the most straightforward type of collateral used for ABS. They generally have 6 or fewer years to maturity, are fully amortizing, and are collateralized by the automobile. Initial loan-to-value (LTV) ratios are usually 80%-90%. \\n\\nMost prepayments on auto loans result from trade-ins or defaults. Refinancings are almost nonexistent because loan rates are significantly higher for used autos than new ones (a loan from a refinancing would be considered a used car loan). \\n\\nAs a result, prepayments are stable and are little affected by the level of interest rates. Compared to unsecured loans such as credit cards, defaults on auto loans are low as cars are almost a necessity and borrowers see the loss of a car through repossession as a substantial burden.\\n\\nIssuance of an auto ABS begins with the creation of a special purpose trust to hold collateral on behalf of investors and to administer the distribution of cash flows. Automobile ABS can be structured in a number of ways, with a pro rata pass-through payment structure being the most common. However, since auto loans amortize over time, principal cash flows are more widely distributed than is desired by many investors who prefer short principal repayment periods. This has led to the tranching of auto ABS, similar to CMOs in the mortgage-backed securities sector. Thus, deals may include PAC tranches that are targeted to investors who want virtual certainty of cash flow, along with support tranches that offer a higher yield in return for greater cash flow uncertainty. However, the average life variability of support tranches for such deals is much less than that for CMOs.\\n\\nAutomobile ABS credit quality is generally quite high and loan loss rates have been very low. A \\\"prime pool\\\" of auto loans is characterized by relatively conservative underwriting standards, new vehicles backing the notes, maturities of less than 5 years, and an originator who has a record of low delinquency and loss performance. Additional credit enhancements are required to support transactions deviating from the prime pool characteristics. The most common credit enhancements for auto ABS are excess spread protection, subordination, reserve funds, and surety bonds.\\n\\nCARDS\\nSecuritized credit card debt.\\n\\nSTUDENT LOANS (\\\"SLABS\\\")\\nABS collateralized by student loans (\\\"SLABS\\\") comprise one of the four (along with home equity loans, auto loans and credit card receivables) core asset classes financed through asset-backed securitizations and are a benchmark subsector for most floating rate indices. Federal Family Education Loan Program (FFELP) loans are the most common form of student loans and are guaranteed by the U.S. Department of Education (\\\"DOE\\\") at rates ranging from 95%-98% (if the student loan is serviced by a servicer designated as an \\\"exceptional performer\\\" by the DOE the reimbursement rate was up to 100%). As a result, performance (other than high cohort default rates in the late 1980's) has historically been very good and investors rate of return has been excellent. The College Cost Reduction and Access Act became effective on October 1, 2007 and significantly changed the economics for FFELP loans; lender special allowance payments were reduced, the exceptional performer designation was revoked, lender insurance rates were reduced, and the lender paid origination fees were doubled.\\nA second, and faster growing, portion of the student loan market consists of non-FFELP or private student loans. Though borrowing limits on certain types of FFELP loans were slightly increased by the student loan bill referenced above, essentially static borrowing limits for FFELP loans and increasing tuition are driving students to search for alternative lenders. Students utilize private loans to bridge the gap between amounts that can be borrowed through federal programs and the remaining costs of education[2].\\nThe United States Congress created the Student Loan Marketing Association (Sallie Mae) as a government sponsored enterprise to purchase student loans in the secondary market and to securitize pools of student loans. Since its first issuance in 1995, Sallie Mae is now the major issuer of SLABS and its issues are viewed as the benchmark issues.\\n\\nHOME EQUITY LOANS\\nSecurities collateralized by home equity loans (HELs) are currently the largest asset class within the ABS market. Investors typically refer to HELs as any nonagency loans that do not fit into either the jumbo or alt-A loan categories. While early HELs were mostly second lien subprime mortgages, first-lien loans now make up the majority of issuance. Subprime mortgage borrowers have a less than perfect credit history and are required to pay interest rates higher than what would be available to a typical agency borrower. In addition to first and second-lien loans, other HE loans can consist of high loan to value (LTV) loans, re-performing loans, scratch and dent loans, or open-ended home equity lines of credit (HELOC),which homeowners use as a method to consolidate debt. [2]\\n\\nEQUIPMENT LEASES\\nABS collateralized by equipment leases.\\n\\nTRADE RECEIVABLES\\nABS collateralized by trade receivables.\\n\\nAIRCRAFT LEASES\\nABS collateralized by aircraft leases.\\n\\nMORTGAGE BACKED SECURITY\\nMortgage-backed securities are sometimes called \\\"mortgage pass-through certificates.\\\"  Mortgage-backed securities pass  through to investors, at a specific coupon, the principal and interest scheduled for payment each month from mortgagors on the outstanding balance of the loans backing the security, and any unscheduled prepayments.\\n\\nAn investment instrument that represents ownership of an undivided interest in a group of mortgages. Principal and interest from the individual mortgages are used to pay principal and interest on the MBS.\\n\\nEx:\\nCOLLATERALIZED MORTGAGE OBLIGATION (CMO)\\nWhile pass-throughs are the primary mechanism for securitization, collateralized mortgage obligations (CMO) is another vehicle for securitizing financial institution assets.    The CMO repackages the cash flows from mortgages and pass-through securities in a different manner.\\n\\nA pass-through security gives each investor a pro rata share of any interest and principal cash flows on a mortgage pool.   By contrast, a CMO can be viewed as a multi-class pass-through with a number of different bond holder classes or tranches.    Unlike a pass-through, which has no guaranteed annual coupon, each bond holder class in a CMO has a different guaranteed coupon that is paid semi-annually like a T-bond.   The allocation of any excess cash flows over and above the guaranteed coupon payments due to increased mortgage prepayments go toward retiring the principal outstanding of only one class of bond holders, which leaves the other classes prepayment protected for a period of time.\\n\\nCMOs give investors greater control over the maturity of the mortgage-backed securities that they buy.    Pass-through security holders have a highly uncertain maturity date due to the risk of rapid prepayments.   \\n\\nCMOs can be created either by packaging and securitizing whole mortgage loans or resecuritizing pass-through securities.\\n\\nINTEREST/PRINCIPAL-ONLY STRIP\\nIn a stripped mortgage-backed security, principal and interest are divided among the classes unequally. For example, one class may be entitled to receive all the principal and the other class all the interest, which is the most common type of stripped mortgage-backed security. \\n\\nInvestors who anticipate prepayments slowing may prefer the interest-only, or IO, class, which counts on principal being outstanding so that interest can be paid on it. Investors who anticipate prepayments rising may prefer the principal-only (PO) class.  \\n\\nLike zero coupon bonds, PO securities are purchased at a substantial discount from face, or par, value. The return an investor realizes depends on the speed at which prepayments are made, the faster the better.\\n\\nMORTGAGE BACKED BOND\\nMortgage Back Bonds (MBB) differ from pass-throughs and CMOs in two key ways.\\n\\n(1) MBBs remain on the balance sheet, whereas pass-throughs and CMOs help remove mortgages from the financial institution balance sheet.\\n\\n(2) The cash flow on the mortgages backing the bond are non necessarily directly connected to interest and principal payments on the MBB.\\n\\nThe financial institution issues a MBB to raise long-term low-cost funds.\\n\\nThe financial institution segregates a group of mortgage assets on the balance sheet and pledges this group of assets as collateral against the MBB issue.\\n\\nMORTGAGE BACKED SECURITY\\nFixed-income securities backed by pools of mortgage loans.\\n\\nMORTGAGE PASS-THROUGH IO STRIP\\nThe mortgage pass-through strip is a special type of CMO with two classes of securities.   The fully-amortized nature of mortgages means that any given monthly payment contains an interest component and a principal component.   \\n\\nThe owner of an IO Strip has a claim to the interest payments made by the mortgage holder in the GNMA pool, which is to the IO components of each month's cash flows received from the underlying mortgage pool.  \\n\\nAn IO strip has no par value.   If interest rates decrease, the value of the IO strip increases.   However, the IO investor receives interest only on the amount of the outstanding principal.\\n\\nMORTGAGE PASS-THROUGH PO STRIP\\nThe mortgage pass-through strip is a special type of CMO with two classes of securities.   The fully-amortized nature of mortgages means that any given monthly payment contains an interest component and a principal component.   \\n\\nThe PO Strip represents the mortgage principal component in each monthly payment by the mortgage holder.   This includes both the scheduled monthly amortized principal component and any prepayments of principal by the mortgage holder.\\n\\nPARTICIPATION CERTIFICATE\\nThe most basic mortgage securities, known as \\\"pass-throughs,\\\" or participation certificates (PCs), represent a direct ownership interest in a pool of mortgage loans. These mortgage securities may be pooled again to create collateral for a more complex type of mortgage security known as a Collateralized Mortgage Obligation (CMO).\\n\\nREMIC\\nCMOs and REMICs (terms which are often used interchangeably) are similar types of securities which allow cash flows to be directed so that different classes of securities with different maturities and coupons can be created. They may be collateralized by mortgage loans as well as securitized pools of loans.\\n\\nA tax entity that issues multiple classes of investor interests (securities) backed by a pool of mortgages.\\n\\nA security that represents a beneficial interest in a trust having multiple classes of securities. The securities of each class entitle investors to cash flows structured differently from the payments on the underlying mortgages.\\n\\nPASS-THROUGH MORTGAGE (\\\"Participation Certificate\\\")\\nFinancial institutions often pool mortgages and other assets that they originate and offer investors an interest in the pool in the form of pass-through certificates or securities.    \\n\\nThe simplest form of MBS is a mortgage pass-through. With this structure, all principal and interest payments (less a servicing fee) from the pool of mortgages are passed directly to investors each month. \\n\\nThe most basic mortgage securities, known as \\\"pass-throughs,\\\" or participation certificates (PCs), represent a direct ownership interest in a pool of mortgage loans. \\n\\nThese mortgage securities may be pooled again to create collateral for a more complex type of mortgage security known as a Collateralized Mortgage Obligation (CMO).\\n\\nEach pass-through mortgage security represents a fractional ownership share in the mortgage pool.\\n\\nPLANNED AMORTIZATION CLASSES (PACS)\\nWhereas in a sequential-pay structure one class receives all the principal payments first (including the prepayments), in a PAC one class receives only the prepayments first. Take the same $100,000 pool of mortgages divided evenly into two classes. Both classes would receive monthly interest and principal payments, but any prepayments would go to Class B (until its principal payments and prepayments reach $50,000 and the bond is retired). Thus, Class B absorbs all the initial prepayment risk and, as a premium to investors incurring this higher risk, Class B offers a higher yield.\\n\\nREAL ESTATE MORTGAGE INVESTMENT CONDUIT (REMIC)\\nA security that represents a beneficial interest in a trust having multiple classes of securities. The securities of each class entitle investors to cash flows structured differently from the payments on the underlying mortgages.\\n\\nZ BONDS\\nIn this structure, one of the classes - the one issued a Z bond -- receives no initial interest or principal payments until the class or classes preceding it are fully paid. The Z bond resembles a zero-coupon bond -- a bond that doesn't pay a regular coupon (or interest payment) but rather is purchased at a discount to what it will pay at maturity. Though Z bondholders don't necessarily have to wait until maturity to receive income, they (like investors in zero coupon bonds) have a long period without any reinvestment risk. Z bonds also minimize the prepayment risk, passing it on to the other classes.\",\"primaryKey\":[\"AssetBackedSecurityTypeId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"name\":\"AssetBackedSecurityTypeId\",\"attributeReference\":{\"entity\":\"AssetBackedSecurityType.cdm.json/AssetBackedSecurityType\",\"name\":\"AssetBackedSecurityTypeId\"},\"dataType\":\"integer\"},{\"type\":\"Existing\",\"name\":\"AssetBackedSecurityTypeName\",\"attributeReference\":{\"entity\":\"AssetBackedSecurityType.cdm.json/AssetBackedSecurityType\",\"name\":\"AssetBackedSecurityTypeName\"},\"dataType\":\"string\",\"dataTypeLength\":128},{\"type\":\"Existing\",\"name\":\"AssetBackedSecurityTypeDescription\",\"attributeReference\":{\"entity\":\"AssetBackedSecurityType.cdm.json/AssetBackedSecurityType\",\"name\":\"AssetBackedSecurityTypeDescription\"},\"dataType\":\"string\",\"dataTypeLength\":512}]}}}",
			"Description": "A type of asset backed security.\n\nEx.:\n- Asset Backed Security\n- Mortgage Backed Security\n\nwhere:\n\nASSET BACKED SECURITY\nAsset-backed securities represent securitized interests in a pool of assets. Issues have been backed by credit card receivables, auto loans and other forms of consumer installment loans. \n\nA security backed by notes or receivables against assets other than real estate. \n\nInvestors receive monthly payments of principal and interest. Securities backed by installment loans operate much like a mortgage pass-through. All principal and interest payments flow directly to investors. \n\nEx:\nCREDIT CARD RECEIVABLES (\"CARDS\")\nDebt instrument collateralized by automobile loan paper .\n\nCredit card debt is known as revolving debt and is a key influence on the structure of credit card ABS.  Credit cardholders are assigned a credit limit and can generally borrow funds up to that amount. They can repay some or all of their debt at any time, and can take on additional debt as long as the total debt is within their credit limit. Cardholders can repay as little or as much principal each month as they desire, subject to a small minimum payment. Thus, there is no true maturity for a credit card account and the amount of principal or loan may fluctuate over time.\n\nThe collateral for a credit card security is the outstanding debt (the receivables) of a group, or pool, of individual credit card accounts. The cash flow available to pay interest to investors comes from the pool's gross revenues, which is made up of finance charges, annual fees, late charges, and interchange (the fee paid to the credit card issuer by a merchant who makes a sale charged to the card). Expenses for the pool consist of the ABS coupon, charge-offs, and a servicing fee.\n\nAn issuer creates a credit card security by first setting up a trust. Then, the issuer sells the outstanding receivables (the current balances and the future cash flows produced by the current balances) of a designated group of credit card accounts to the trust. Additionally, the issuer transfers the right to purchase, at par, any future balances generated by the same group of accounts. The balance of receivables outstanding is collateralized into two types of securities, known as investor and seller certificates. The investor certificate is sold to ABS investors and the seller certificate is retained by the card issuer. The holder of the seller certificate receives all finance charge cash flows from the receivables that remain after payment of the investor certificate coupon, the collateral pool servicing fee, charge-offs, and trust expenses. The balance of the seller certificate fluctuates over time as cardholders pay off their balances and make new purchases. The cash flow available to pay the investor coupon depends on the amount of principal outstanding. If the pool's principal is paid down more quickly than new charges are added to the point where the balance falls below an established minimum, the seller must add more accounts to the pool.\n\nAUTOMOBILE LOANS (\"CARS\")\nDebt instrument collateralized by automobile loan paper .\n\nABS backed by automobile loans were the first major sector of the market. Automobile loans are the most straightforward type of collateral used for ABS. They generally have 6 or fewer years to maturity, are fully amortizing, and are collateralized by the automobile. Initial loan-to-value (LTV) ratios are usually 80%-90%. \n\nMost prepayments on auto loans result from trade-ins or defaults. Refinancings are almost nonexistent because loan rates are significantly higher for used autos than new ones (a loan from a refinancing would be considered a used car loan). \n\nAs a result, prepayments are stable and are little affected by the level of interest rates. Compared to unsecured loans such as credit cards, defaults on auto loans are low as cars are almost a necessity and borrowers see the loss of a car through repossession as a substantial burden.\n\nIssuance of an auto ABS begins with the creation of a special purpose trust to hold collateral on behalf of investors and to administer the distribution of cash flows. Automobile ABS can be structured in a number of ways, with a pro rata pass-through payment structure being the most common. However, since auto loans amortize over time, principal cash flows are more widely distributed than is desired by many investors who prefer short principal repayment periods. This has led to the tranching of auto ABS, similar to CMOs in the mortgage-backed securities sector. Thus, deals may include PAC tranches that are targeted to investors who want virtual certainty of cash flow, along with support tranches that offer a higher yield in return for greater cash flow uncertainty. However, the average life variability of support tranches for such deals is much less than that for CMOs.\n\nAutomobile ABS credit quality is generally quite high and loan loss rates have been very low. A \"prime pool\" of auto loans is characterized by relatively conservative underwriting standards, new vehicles backing the notes, maturities of less than 5 years, and an originator who has a record of low delinquency and loss performance. Additional credit enhancements are required to support transactions deviating from the prime pool characteristics. The most common credit enhancements for auto ABS are excess spread protection, subordination, reserve funds, and surety bonds.\n\nCARDS\nSecuritized credit card debt.\n\nSTUDENT LOANS (\"SLABS\")\nABS collateralized by student loans (\"SLABS\") comprise one of the four (along with home equity loans, auto loans and credit card receivables) core asset classes financed through asset-backed securitizations and are a benchmark subsector for most floating rate indices. Federal Family Education Loan Program (FFELP) loans are the most common form of student loans and are guaranteed by the U.S. Department of Education (\"DOE\") at rates ranging from 95%-98% (if the student loan is serviced by a servicer designated as an \"exceptional performer\" by the DOE the reimbursement rate was up to 100%). As a result, performance (other than high cohort default rates in the late 1980's) has historically been very good and investors rate of return has been excellent. The College Cost Reduction and Access Act became effective on October 1, 2007 and significantly changed the economics for FFELP loans; lender special allowance payments were reduced, the exceptional performer designation was revoked, lender insurance rates were reduced, and the lender paid origination fees were doubled.\nA second, and faster growing, portion of the student loan market consists of non-FFELP or private student loans. Though borrowing limits on certain types of FFELP loans were slightly increased by the student loan bill referenced above, essentially static borrowing limits for FFELP loans and increasing tuition are driving students to search for alternative lenders. Students utilize private loans to bridge the gap between amounts that can be borrowed through federal programs and the remaining costs of education[2].\nThe United States Congress created the Student Loan Marketing Association (Sallie Mae) as a government sponsored enterprise to purchase student loans in the secondary market and to securitize pools of student loans. Since its first issuance in 1995, Sallie Mae is now the major issuer of SLABS and its issues are viewed as the benchmark issues.\n\nHOME EQUITY LOANS\nSecurities collateralized by home equity loans (HELs) are currently the largest asset class within the ABS market. Investors typically refer to HELs as any nonagency loans that do not fit into either the jumbo or alt-A loan categories. While early HELs were mostly second lien subprime mortgages, first-lien loans now make up the majority of issuance. Subprime mortgage borrowers have a less than perfect credit history and are required to pay interest rates higher than what would be available to a typical agency borrower. In addition to first and second-lien loans, other HE loans can consist of high loan to value (LTV) loans, re-performing loans, scratch and dent loans, or open-ended home equity lines of credit (HELOC),which homeowners use as a method to consolidate debt. [2]\n\nEQUIPMENT LEASES\nABS collateralized by equipment leases.\n\nTRADE RECEIVABLES\nABS collateralized by trade receivables.\n\nAIRCRAFT LEASES\nABS collateralized by aircraft leases.\n\nMORTGAGE BACKED SECURITY\nMortgage-backed securities are sometimes called \"mortgage pass-through certificates.\"  Mortgage-backed securities pass  through to investors, at a specific coupon, the principal and interest scheduled for payment each month from mortgagors on the outstanding balance of the loans backing the security, and any unscheduled prepayments.\n\nAn investment instrument that represents ownership of an undivided interest in a group of mortgages. Principal and interest from the individual mortgages are used to pay principal and interest on the MBS.\n\nEx:\nCOLLATERALIZED MORTGAGE OBLIGATION (CMO)\nWhile pass-throughs are the primary mechanism for securitization, collateralized mortgage obligations (CMO) is another vehicle for securitizing financial institution assets.    The CMO repackages the cash flows from mortgages and pass-through securities in a different manner.\n\nA pass-through security gives each investor a pro rata share of any interest and principal cash flows on a mortgage pool.   By contrast, a CMO can be viewed as a multi-class pass-through with a number of different bond holder classes or tranches.    Unlike a pass-through, which has no guaranteed annual coupon, each bond holder class in a CMO has a different guaranteed coupon that is paid semi-annually like a T-bond.   The allocation of any excess cash flows over and above the guaranteed coupon payments due to increased mortgage prepayments go toward retiring the principal outstanding of only one class of bond holders, which leaves the other classes prepayment protected for a period of time.\n\nCMOs give investors greater control over the maturity of the mortgage-backed securities that they buy.    Pass-through security holders have a highly uncertain maturity date due to the risk of rapid prepayments.   \n\nCMOs can be created either by packaging and securitizing whole mortgage loans or resecuritizing pass-through securities.\n\nINTEREST/PRINCIPAL-ONLY STRIP\nIn a stripped mortgage-backed security, principal and interest are divided among the classes unequally. For example, one class may be entitled to receive all the principal and the other class all the interest, which is the most common type of stripped mortgage-backed security. \n\nInvestors who anticipate prepayments slowing may prefer the interest-only, or IO, class, which counts on principal being outstanding so that interest can be paid on it. Investors who anticipate prepayments rising may prefer the principal-only (PO) class.  \n\nLike zero coupon bonds, PO securities are purchased at a substantial discount from face, or par, value. The return an investor realizes depends on the speed at which prepayments are made, the faster the better.\n\nMORTGAGE BACKED BOND\nMortgage Back Bonds (MBB) differ from pass-throughs and CMOs in two key ways.\n\n(1) MBBs remain on the balance sheet, whereas pass-throughs and CMOs help remove mortgages from the financial institution balance sheet.\n\n(2) The cash flow on the mortgages backing the bond are non necessarily directly connected to interest and principal payments on the MBB.\n\nThe financial institution issues a MBB to raise long-term low-cost funds.\n\nThe financial institution segregates a group of mortgage assets on the balance sheet and pledges this group of assets as collateral against the MBB issue.\n\nMORTGAGE BACKED SECURITY\nFixed-income securities backed by pools of mortgage loans.\n\nMORTGAGE PASS-THROUGH IO STRIP\nThe mortgage pass-through strip is a special type of CMO with two classes of securities.   The fully-amortized nature of mortgages means that any given monthly payment contains an interest component and a principal component.   \n\nThe owner of an IO Strip has a claim to the interest payments made by the mortgage holder in the GNMA pool, which is to the IO components of each month's cash flows received from the underlying mortgage pool.  \n\nAn IO strip has no par value.   If interest rates decrease, the value of the IO strip increases.   However, the IO investor receives interest only on the amount of the outstanding principal.\n\nMORTGAGE PASS-THROUGH PO STRIP\nThe mortgage pass-through strip is a special type of CMO with two classes of securities.   The fully-amortized nature of mortgages means that any given monthly payment contains an interest component and a principal component.   \n\nThe PO Strip represents the mortgage principal component in each monthly payment by the mortgage holder.   This includes both the scheduled monthly amortized principal component and any prepayments of principal by the mortgage holder.\n\nPARTICIPATION CERTIFICATE\nThe most basic mortgage securities, known as \"pass-throughs,\" or participation certificates (PCs), represent a direct ownership interest in a pool of mortgage loans. These mortgage securities may be pooled again to create collateral for a more complex type of mortgage security known as a Collateralized Mortgage Obligation (CMO).\n\nREMIC\nCMOs and REMICs (terms which are often used interchangeably) are similar types of securities which allow cash flows to be directed so that different classes of securities with different maturities and coupons can be created. They may be collateralized by mortgage loans as well as securitized pools of loans.\n\nA tax entity that issues multiple classes of investor interests (securities) backed by a pool of mortgages.\n\nA security that represents a beneficial interest in a trust having multiple classes of securities. The securities of each class entitle investors to cash flows structured differently from the payments on the underlying mortgages.\n\nPASS-THROUGH MORTGAGE (\"Participation Certificate\")\nFinancial institutions often pool mortgages and other assets that they originate and offer investors an interest in the pool in the form of pass-through certificates or securities.    \n\nThe simplest form of MBS is a mortgage pass-through. With this structure, all principal and interest payments (less a servicing fee) from the pool of mortgages are passed directly to investors each month. \n\nThe most basic mortgage securities, known as \"pass-throughs,\" or participation certificates (PCs), represent a direct ownership interest in a pool of mortgage loans. \n\nThese mortgage securities may be pooled again to create collateral for a more complex type of mortgage security known as a Collateralized Mortgage Obligation (CMO).\n\nEach pass-through mortgage security represents a fractional ownership share in the mortgage pool.\n\nPLANNED AMORTIZATION CLASSES (PACS)\nWhereas in a sequential-pay structure one class receives all the principal payments first (including the prepayments), in a PAC one class receives only the prepayments first. Take the same $100,000 pool of mortgages divided evenly into two classes. Both classes would receive monthly interest and principal payments, but any prepayments would go to Class B (until its principal payments and prepayments reach $50,000 and the bond is retired). Thus, Class B absorbs all the initial prepayment risk and, as a premium to investors incurring this higher risk, Class B offers a higher yield.\n\nREAL ESTATE MORTGAGE INVESTMENT CONDUIT (REMIC)\nA security that represents a beneficial interest in a trust having multiple classes of securities. The securities of each class entitle investors to cash flows structured differently from the payments on the underlying mortgages.\n\nZ BONDS\nIn this structure, one of the classes - the one issued a Z bond -- receives no initial interest or principal payments until the class or classes preceding it are fully paid. The Z bond resembles a zero-coupon bond -- a bond that doesn't pay a regular coupon (or interest payment) but rather is purchased at a discount to what it will pay at maturity. Though Z bondholders don't necessarily have to wait until maturity to receive income, they (like investors in zero coupon bonds) have a long period without any reinvestment risk. Z bonds also minimize the prepayment risk, passing it on to the other classes.",
			"DisplayFolderInfo": "{\"name\":\"Financial Product\",\"colorCode\":\"#001475\"}",
			"PrimaryKeys": "AssetBackedSecurityTypeId",
			"spark.sql.sources.provider": "csv"
		},
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false
	},
	"type": "TABLE"
}