{
	"name": "EducationLoanProduct",
	"properties": {
		"Namespace": {
			"DatabaseName": "banking"
		},
		"Name": "EducationLoanProduct",
		"Description": "A loan issued for the purpose of financing education expenses, primarily college education.\n\nThey come in several varieties in the United States:\n\n- Federal student loans made to students directly: No payments while enrolled in at least half time status. If a student drops below half time status, the account will go into its 6 month grace period. If the student re-enrolls in at least half time status, the loans will be deferred, but when they drop below half time again they will no longer have their grace period. Amounts are quite limited as well.\n\n- Federal student loans made to parents: Much higher limit, but payments start immediately\n\n- Private student loans made to students or parents: Higher limits and no payments until after graduation, although interest will start to accrue immediately. Private loans may be used for any education related expenses such as tuition, room and board, books, computers, and past due balances. Private loans can also be used to supplement federal student loans, when federal loans, grants and other forms of financial aid are not sufficient to cover the full cost of higher education.\n\nFederal loans to students\n- Federal Perkins Loan\n- Stafford loan\n- Federal Family Education Loans\n- Ford Direct Student Loans\n- Federal student loan consolidation\n\nFederal student loans in the United States are authorized under Title IV of the Higher Education Act as amended.\n\nThese loans are available to college and university students via funds disbursed directly to the school and are used to supplement personal and family resources, scholarships, grants, and work-study. They may be subsidized by the U.S. Government or may be unsubsidized depending on the student's financial need.\n\nBoth subsidized and unsubsidized loans are guaranteed by the U.S. Department of Education either directly or through guaranty agencies. Nearly all students are eligible to receive federal loans.  Both types offer a grace period of six months, which means that no payments are due until six months after graduation or after the borrower becomes a less-than-half-time student without graduating. Both types have a fairly modest annual limit. The dependent undergraduate limit effective for loans disbursed on or after July 1, 2008 is as follows (combined subsidized and unsubsidized limits): $5,500 per year for freshman undergraduate students, $6,500 for sophomore undergraduates, and $7,500 per year for junior and senior undergraduate students, as well as students enrolled in teacher certification or preparatory coursework for graduate programs. For independent undergraduates, the limits (combined subsidized and unsubsidized) effective for loans disbursed on or after July 1, 2008 are higher: $9,500 per year for freshman undergraduate students, $10,500 for sophomore undergraduates, and $12,500 per year for junior and senior undergraduate students, as well as students enrolled in teacher certification or preparatory coursework for graduate programs. Subsidized federal student loans are only offered to students with a demonstrated financial need. Financial need may vary from school to school. For these loans, the federal government makes interest payments while the student is in college. For example, those who borrow $10,000 during college will owe $10,000 upon graduation.\nUnsubsidized federal student loans are also guaranteed by the U.S. Government, but the government does not pay interest for the student, rather the interest accrues during college. Nearly all student are eligible for these loans regardless of demonstrated need. Those who borrow $10,000 during college will owe $10,000 plus interest upon graduation. For example, those who have borrowed $10,000 and had $2,000 accrue in interest will owe $12,000. Interest will begin accruing on the $12,000. The accrued interest will be \"capitalized\" into the loan amount, and the borrower will begin making payments on the accumulated total. Students can choose to pay the interest while still in college; however, few students choose to exercise this option.\n\nFederal student loans for graduate students have higher limits: $8,500 for subsidized Stafford and $12,500 (limits may differ for certain courses of study) for unsubsidized Stafford. Many students also take advantage of the Federal Perkins Loan. For graduate students the limit for Perkins is $6,000 per year.\n\nFederal student loans to parents\nUsually these are PLUS loans (formerly standing for \"Parent Loan for Undergraduate Students\"). Unlike loans made to students, parents can borrow much more - usually enough to cover any gap in the cost of education. However, there is no grace period: Payments start immediately.\nParents should be aware that they are responsible for repayment on these loans, not the student. This is not a 'cosigner' loan with the student having equal accountability. The parents have signed the master promissory note to pay and, if they do not do so, it is their credit rating that suffers. Also, parents are advised to consider \"year 4\" payments, rather than \"year 1\" payments. What sounds like a \"manageable\" debt load of $200 a month in freshman year can mushroom to a much more daunting $800 a month by the time four years have been funded through loans. The combination of immediate repayment and the ability to borrow substantial sums can be expensive.\nUnder new legislation, graduate students are eligible to receive PLUS loans in their own names. These Graduate PLUS loans have the same interest rates and terms of Parent PLUS loans.\n\nParents should also be aware that legislation raised the interest rate on these loans significantly - to 8.5% on July 1, 2006.\n\nThere are two distribution channels for federal student loans: Federal Direct Student Loans and Federal Family Education Loans.\n\n- Federal Direct Student Loans, also known as Direct Loans or FDLP loans, are funded from public capital originating with the U.S. Treasury. FDLP loans are distributed through a channel that begins with the U.S. Treasury Department and from there passes through the U.S. Department of Education, then to the college or university and then to the student.\n\n- Federal Family Education Loan Program loans, also known as FFEL loans or FFELP loans, are funded with private capital provided by banking institutions (i.e., banks, savings and loans, and credit unions). Because the FFELP loans use private capital as their source, students who use FFELP loans are able to take advantage of payment options that are similar to those available to customers who take out a home loan or a consumer loan. For example, some institutions will allow a discount for automatic payments or a series of on-time payments. In 2005, approximately two-thirds of all federally subsidized student loans were FFELP.\nAccording to the U.S. Department of Education, more than 6,000 colleges, universities, and technical schools participate in FFELP, which represents about 80% of all schools. FFELP lending represents 75% of all federal student loan volume.\n\nThe maximum amount that any student can borrow is adjusted from time to time as federal policies change. A study published in the winter 1996 edition of the Journal of Student Financial Aid, \"How Much Student Loan Debt Is Too Much?\" suggested that the monthly student debt payment for the average undergraduate should not exceed 8% of total monthly income after graduation. Some financial aid advisers have referred this as \"the 8% rule.\" Circumstances vary for individuals, so the 8% level is an indicator, not a rule set in stone. A research report about the 8% level is available at [1].\nPrivate student loans\n\nThese are loans that are not guaranteed by a government agency and are made to students by banks or finance companies. Advocates of private student loans suggest that they combine the best elements of the different government loans into one: They generally offer higher loan limits than federal student loans, ensuring the student is not left with a budget gap. But unlike federal parent loans, they generally offer a grace period with no payments due until after graduation (this grace period ranges as high as 12 months after graduation, though most private lenders offer six months). However, some higher education advocates are private loan detractors because of the higher interest rates, multiple fees, and lack of borrower protections private loans carry that are not associated with federal loans. \nPrivate student loan types\n\nPrivate loans generally come in two types: school-channel and direct-to-consumer.\n\nSchool-channel loans offer borrowers lower interest rates but generally take longer to process. School-channel loans are 'certified' by the school, which means the school signs off on the borrowing amount, and the funds for school-channel loans are disbursed directly to the school.\n\nDirect-to-consumer private loans are not certified by the school; schools don't interact with a direct-to-consumer private loan at all. The student simply supplies enrollment verification to the lender, and the loan proceeds are disbursed directly to the student. While direct-to-consumer loans generally carry higher interest rates than school-channel loans, they do allow families to get access to funds very quickly - in some cases, in a matter of days. Some argue that this convenience is offset by the risk of student over-borrowing and/or use of funds for inappropriate purposes, since there is no third-party certification that the amount of the loan is appropriate for the education finance needs of the student in question.\n\nDirect-to-consumer private loans are the fastest growing segment of education finance and under legislative scrutiny due to the lack of school certification. Loan providers range from large education finance companies to specialty companies that focus exclusively on this niche. Such loans will often be distinguished by the indication that \"no FAFSA is required\" or \"Funds disbursed directly to you.\"\n\nPrivate student loan rates and interest\nPrivate student loans typically have variable interest rates while federal student loans have fixed rates. Consumers should be aware that some private loans require substantial up-front origination fees. These fees raise the real cost to the borrower and reduce the amount of money available for educational purposes.\n\nMost private loan programs are tied to one or more financial indexes, such as the Wall Street Journal Prime rate or the BBA LIBOR rate, plus an overhead charge. Because private loans are based on the credit history of the applicant, the overhead charge will vary. Students and families with excellent credit will generally receive lower rates and smaller loan origination fees than those with less than perfect credit. Money paid toward interest is now tax deductible. However, lenders rarely give complete details of the terms of the private student loan until after the student submits an application, in part because this helps prevent comparisons based on cost. For example, many lenders will only advertise the lowest interest rate they charge (for good credit borrowers). Borrowers with bad credit can expect interest rates that are as much as 6% higher, loan fees that are as much as 9% higher, and loan limits that are two-thirds lower than the advertised figures.[3]\n\nPrivate student loan fees\nPrivate loans often carry an origination fee. Origination fees are a one-time charge based on the amount of the loan. They can be taken out of the total loan amount or added on top of the total loan amount, often at the borrower's preference. Some lenders offer low-interest, 0-fee loans. Each percentage point on the front-end fee gets paid once, while each percentage point on the interest rate is calculated and paid throughout the life of the loan. Some have suggested that this makes the interest rate more critical than the origination fee.\n\nIn fact, there is an easy solution to the fee-vs.-rate question: All lenders are legally required to provide you a statement of the \"APR (Annual Percentage Rate)\" for the loan before you sign a promissory note and commit to it. Unlike the \"base\" rate, this rate includes any fees charged and can be thought of as the \"effective\" interest rate including actual interest, fees, etc. When comparing loans, it may be easier to compare APR rather than \"rate\" to ensure an apples-to-apples comparison. APR is the best yardstick to compare loans that have the same repayment term; however, if the repayment terms are different, APR becomes a less-perfect comparison tool. With different term loans, consumers often look to 'total financing costs' to understand their financing options.\n\nEligible loan programs generally issue loans based on the credit history of the applicant and any applicable cosigner/co-endorser/coborrower. This is in contrast to federal loan programs that deal primarily with need-based criteria, as defined by the EFC and the FAFSA. For many students, this is a great advantage to private loan programs, as their families may have too much income or too many assets to qualify for federal aid but insufficient assets and income to pay for school without assistance.\n\nAdditionally, many international students in the United States can obtain private loans (they are ineligible for federal loans in many cases) with a cosigner who is a United States citizen or permanent resident. However, some graduate programs (notably top MBA programs) have a tie-up with private loan providers and in those cases no co-signor is needed even for international students.\n\nThe terms for private loans vary from lender to lender. A common suggestion is to shop around on ALL terms, not just respond to \"rates as low as...\" tactics that are sometimes little more than bait-and-switch. However, shopping around could damage your credit score.[4] Examples of other borrower terms and benefits that vary by lender are deferments (amount of time after leaving school before payments start) and forbearances (a period when payments are temporarily stopped due to financial or other hardship). These policies are solely based on the contract between lender and borrower and not set by Department of Education policies.\nFederally subsidized consolidations are not available for private student loans,[5] though several lenders offer private consolidation programs. Borrowers of privately subsidized student loans may face the same restrictions to bankruptcy discharge as for government based loans: New legislation makes clear that these loans are, like federal student loans, not dischargeable under bankruptcy. Even before the legislation was passed, however, private student loans that were guaranteed 'in whole or in part' by a nonprofit entity are non-dischargeable in bankruptcy (and most private loans, regardless of the lender, were indeed guaranteed by a nonprofit).\nDischarge of student loans\n\nUS Federal student loans and some private student loans can be discharged in bankruptcy only with a showing of \"undue hardship.\" Bankruptcy Code Section 523(a)(8) determines what loans can and can not be discharged. The undue hardship standard varies from jurisdiction to jurisdiction, but is generally difficult to meet, making student loans practically non-dischargeable through bankruptcy. While US Federal student loans can be discharged for total and permanent disability, private student loans cannot be discharged outside of bankruptcy.",
		"EntityType": "TABLE",
		"TableType": "EXTERNAL",
		"Origin": {
			"Type": "SPARK"
		},
		"StorageDescriptor": {
			"Columns": [
				{
					"Name": "ProductId",
					"Description": "The unique identifier of a Product.",
					"BaseAttributeReference": {
						"Entity": "EducationLoanProduct.cdm.json/EducationLoanProduct",
						"Name": "ProductId"
					},
					"OriginDataTypeName": {
						"TypeName": "long",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "long"
						}
					}
				},
				{
					"Name": "EducationLoanAutomaticPaymentInterestRateReductionPercentage",
					"Description": "The percentage by which the loan is reduced in return from automatic payments being made.",
					"BaseAttributeReference": {
						"Entity": "EducationLoanProduct.cdm.json/EducationLoanProduct",
						"Name": "EducationLoanAutomaticPaymentInterestRateReductionPercentage"
					},
					"OriginDataTypeName": {
						"TypeName": "decimal",
						"IsComplexType": false,
						"IsNullable": true,
						"Precision": 18,
						"Scale": 8,
						"Properties": {
							"HIVE_TYPE_STRING": "decimal"
						}
					}
				},
				{
					"Name": "EducationLoanNoticeOfLoanGuaranteeAndDisclosureStatement",
					"Description": "Statement sent to borrowers at the time the loan is disbursed. It includes information on the total loan amount, fees, and disbursement dates. Also included on this statement is information regarding total indebtedness and repayment.",
					"BaseAttributeReference": {
						"Entity": "EducationLoanProduct.cdm.json/EducationLoanProduct",
						"Name": "EducationLoanNoticeOfLoanGuaranteeAndDisclosureStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "EducationLoanEligibilityRequirementStatement",
					"Description": "A statement regarding the eligibility requirements associated with the loan.\n\nEx:\n- Be enrolled and seeking a degree or multi-course certificate at an eligible school.\n\n- Be enrolled in an eligible program. (Students in allopathic or osteopathic medicine, or JSD, LLM, or JD law programs are not eligible\n\n- Have an established, positive credit history, an acceptable debt-to-income ratio, and a minimum income of $12,000 - or a cosigner who does.\n\n- Be a U.S. citizen, U.S. national, permanent resident alien without conditions, or international student who is a temporary resident alien with a current U.S. address and proper evidence of eligibility. For permanent and temporary resident aliens, a U.S. citizen cosigner is required.",
					"BaseAttributeReference": {
						"Entity": "EducationLoanProduct.cdm.json/EducationLoanProduct",
						"Name": "EducationLoanEligibilityRequirementStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "EducationLoanDefermentStatement",
					"Description": "A deferment reduces or eliminates part of the loan in return for the loan participant taking part in a program that compensates for that amount.\n\nEx:\nThe Federal Teacher Shortage Loan Deferment Program is a program that provides teachers teaching in designated school districts the benefits of deferring their Stafford Loans and Supplemental Student Loans (the teacher will still be responsible for the principal at the completion of the deferment), and/or a reduction of teaching responsibility for Paul Douglas Scholarship recipients. Benefits of this program are extended only to teachers in designated shortage areas. \n\nIn Arizona, the designation of teacher shortage areas under the federal Teacher Shortage Loan Deferment program is based upon geographic location (school district). Every school district in Arizona is considered for loan deferment benefits. Teacher shortage is determined by computing the proportion of full-time teachers holding either an emergency or provisional teaching certificate. Only 5% of the total teaching population in Arizona is eligible for the loan deferment.\n\nOnce a school district has been designated as a teacher shortage area, all schools, including charter schools, private schools and federal BIA schools, located within the district boundaries are qualified for assistance.",
					"BaseAttributeReference": {
						"Entity": "EducationLoanProduct.cdm.json/EducationLoanProduct",
						"Name": "EducationLoanDefermentStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "ForbearanceStatement",
					"Description": "A forbearance temporarily reduces or suspends a student's monthly education loan payment during a period of financial hardship. Forbearances typically are granted by the education loan servicer for up to a year at a time. During forbearance, students are still responsible for the accruing education loan interest.",
					"BaseAttributeReference": {
						"Entity": "EducationLoanProduct.cdm.json/EducationLoanProduct",
						"Name": "ForbearanceStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "RepaymentPlanTypeId",
					"Description": "The unique identifier of a Repayment Plan.",
					"BaseAttributeReference": {
						"Entity": "EducationLoanProduct.cdm.json/EducationLoanProduct",
						"Name": "RepaymentPlanTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "EducationLoanTypeId",
					"Description": "The unique identifier of an education loan type.",
					"BaseAttributeReference": {
						"Entity": "EducationLoanProduct.cdm.json/EducationLoanProduct",
						"Name": "EducationLoanTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				}
			],
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://dpu@adlsgen2deepu.dfs.core.windows.net/dpu_json_test/EducationLoanProduct",
					"delimiter": ",",
					"multiLine": "false",
					"firstRowAsHeader": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://dpu@adlsgen2deepu.dfs.core.windows.net/dpu_json_test/EducationLoanProduct",
				"Properties": {
					"LinkedServiceName": "wspc-dpu-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "{\"type\":\"None\",\"level\":\"optimal\"}",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"ProductId\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"ProductId\"},\"EducationLoanAutomaticPaymentInterestRateReductionPercentage\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanAutomaticPaymentInterestRateReductionPercentage\"},\"EducationLoanNoticeOfLoanGuaranteeAndDisclosureStatement\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanNoticeOfLoanGuaranteeAndDisclosureStatement\"},\"EducationLoanEligibilityRequirementStatement\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanEligibilityRequirementStatement\"},\"EducationLoanDefermentStatement\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanDefermentStatement\"},\"ForbearanceStatement\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"ForbearanceStatement\"},\"RepaymentPlanTypeId\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"RepaymentPlanTypeId\"},\"EducationLoanTypeId\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanTypeId\"}}}"
			},
			"Compressed": false,
			"IsStoredAsSubdirectories": false
		},
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"EducationLoanProduct\",\"path\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\"},\"description\":\"A loan issued for the purpose of financing education expenses, primarily college education.\\n\\nThey come in several varieties in the United States:\\n\\n- Federal student loans made to students directly: No payments while enrolled in at least half time status. If a student drops below half time status, the account will go into its 6 month grace period. If the student re-enrolls in at least half time status, the loans will be deferred, but when they drop below half time again they will no longer have their grace period. Amounts are quite limited as well.\\n\\n- Federal student loans made to parents: Much higher limit, but payments start immediately\\n\\n- Private student loans made to students or parents: Higher limits and no payments until after graduation, although interest will start to accrue immediately. Private loans may be used for any education related expenses such as tuition, room and board, books, computers, and past due balances. Private loans can also be used to supplement federal student loans, when federal loans, grants and other forms of financial aid are not sufficient to cover the full cost of higher education.\\n\\nFederal loans to students\\n- Federal Perkins Loan\\n- Stafford loan\\n- Federal Family Education Loans\\n- Ford Direct Student Loans\\n- Federal student loan consolidation\\n\\nFederal student loans in the United States are authorized under Title IV of the Higher Education Act as amended.\\n\\nThese loans are available to college and university students via funds disbursed directly to the school and are used to supplement personal and family resources, scholarships, grants, and work-study. They may be subsidized by the U.S. Government or may be unsubsidized depending on the student's financial need.\\n\\nBoth subsidized and unsubsidized loans are guaranteed by the U.S. Department of Education either directly or through guaranty agencies. Nearly all students are eligible to receive federal loans.  Both types offer a grace period of six months, which means that no payments are due until six months after graduation or after the borrower becomes a less-than-half-time student without graduating. Both types have a fairly modest annual limit. The dependent undergraduate limit effective for loans disbursed on or after July 1, 2008 is as follows (combined subsidized and unsubsidized limits): $5,500 per year for freshman undergraduate students, $6,500 for sophomore undergraduates, and $7,500 per year for junior and senior undergraduate students, as well as students enrolled in teacher certification or preparatory coursework for graduate programs. For independent undergraduates, the limits (combined subsidized and unsubsidized) effective for loans disbursed on or after July 1, 2008 are higher: $9,500 per year for freshman undergraduate students, $10,500 for sophomore undergraduates, and $12,500 per year for junior and senior undergraduate students, as well as students enrolled in teacher certification or preparatory coursework for graduate programs. Subsidized federal student loans are only offered to students with a demonstrated financial need. Financial need may vary from school to school. For these loans, the federal government makes interest payments while the student is in college. For example, those who borrow $10,000 during college will owe $10,000 upon graduation.\\nUnsubsidized federal student loans are also guaranteed by the U.S. Government, but the government does not pay interest for the student, rather the interest accrues during college. Nearly all student are eligible for these loans regardless of demonstrated need. Those who borrow $10,000 during college will owe $10,000 plus interest upon graduation. For example, those who have borrowed $10,000 and had $2,000 accrue in interest will owe $12,000. Interest will begin accruing on the $12,000. The accrued interest will be \\\"capitalized\\\" into the loan amount, and the borrower will begin making payments on the accumulated total. Students can choose to pay the interest while still in college; however, few students choose to exercise this option.\\n\\nFederal student loans for graduate students have higher limits: $8,500 for subsidized Stafford and $12,500 (limits may differ for certain courses of study) for unsubsidized Stafford. Many students also take advantage of the Federal Perkins Loan. For graduate students the limit for Perkins is $6,000 per year.\\n\\nFederal student loans to parents\\nUsually these are PLUS loans (formerly standing for \\\"Parent Loan for Undergraduate Students\\\"). Unlike loans made to students, parents can borrow much more - usually enough to cover any gap in the cost of education. However, there is no grace period: Payments start immediately.\\nParents should be aware that they are responsible for repayment on these loans, not the student. This is not a 'cosigner' loan with the student having equal accountability. The parents have signed the master promissory note to pay and, if they do not do so, it is their credit rating that suffers. Also, parents are advised to consider \\\"year 4\\\" payments, rather than \\\"year 1\\\" payments. What sounds like a \\\"manageable\\\" debt load of $200 a month in freshman year can mushroom to a much more daunting $800 a month by the time four years have been funded through loans. The combination of immediate repayment and the ability to borrow substantial sums can be expensive.\\nUnder new legislation, graduate students are eligible to receive PLUS loans in their own names. These Graduate PLUS loans have the same interest rates and terms of Parent PLUS loans.\\n\\nParents should also be aware that legislation raised the interest rate on these loans significantly - to 8.5% on July 1, 2006.\\n\\nThere are two distribution channels for federal student loans: Federal Direct Student Loans and Federal Family Education Loans.\\n\\n- Federal Direct Student Loans, also known as Direct Loans or FDLP loans, are funded from public capital originating with the U.S. Treasury. FDLP loans are distributed through a channel that begins with the U.S. Treasury Department and from there passes through the U.S. Department of Education, then to the college or university and then to the student.\\n\\n- Federal Family Education Loan Program loans, also known as FFEL loans or FFELP loans, are funded with private capital provided by banking institutions (i.e., banks, savings and loans, and credit unions). Because the FFELP loans use private capital as their source, students who use FFELP loans are able to take advantage of payment options that are similar to those available to customers who take out a home loan or a consumer loan. For example, some institutions will allow a discount for automatic payments or a series of on-time payments. In 2005, approximately two-thirds of all federally subsidized student loans were FFELP.\\nAccording to the U.S. Department of Education, more than 6,000 colleges, universities, and technical schools participate in FFELP, which represents about 80% of all schools. FFELP lending represents 75% of all federal student loan volume.\\n\\nThe maximum amount that any student can borrow is adjusted from time to time as federal policies change. A study published in the winter 1996 edition of the Journal of Student Financial Aid, \\\"How Much Student Loan Debt Is Too Much?\\\" suggested that the monthly student debt payment for the average undergraduate should not exceed 8% of total monthly income after graduation. Some financial aid advisers have referred this as \\\"the 8% rule.\\\" Circumstances vary for individuals, so the 8% level is an indicator, not a rule set in stone. A research report about the 8% level is available at [1].\\nPrivate student loans\\n\\nThese are loans that are not guaranteed by a government agency and are made to students by banks or finance companies. Advocates of private student loans suggest that they combine the best elements of the different government loans into one: They generally offer higher loan limits than federal student loans, ensuring the student is not left with a budget gap. But unlike federal parent loans, they generally offer a grace period with no payments due until after graduation (this grace period ranges as high as 12 months after graduation, though most private lenders offer six months). However, some higher education advocates are private loan detractors because of the higher interest rates, multiple fees, and lack of borrower protections private loans carry that are not associated with federal loans. \\nPrivate student loan types\\n\\nPrivate loans generally come in two types: school-channel and direct-to-consumer.\\n\\nSchool-channel loans offer borrowers lower interest rates but generally take longer to process. School-channel loans are 'certified' by the school, which means the school signs off on the borrowing amount, and the funds for school-channel loans are disbursed directly to the school.\\n\\nDirect-to-consumer private loans are not certified by the school; schools don't interact with a direct-to-consumer private loan at all. The student simply supplies enrollment verification to the lender, and the loan proceeds are disbursed directly to the student. While direct-to-consumer loans generally carry higher interest rates than school-channel loans, they do allow families to get access to funds very quickly - in some cases, in a matter of days. Some argue that this convenience is offset by the risk of student over-borrowing and/or use of funds for inappropriate purposes, since there is no third-party certification that the amount of the loan is appropriate for the education finance needs of the student in question.\\n\\nDirect-to-consumer private loans are the fastest growing segment of education finance and under legislative scrutiny due to the lack of school certification. Loan providers range from large education finance companies to specialty companies that focus exclusively on this niche. Such loans will often be distinguished by the indication that \\\"no FAFSA is required\\\" or \\\"Funds disbursed directly to you.\\\"\\n\\nPrivate student loan rates and interest\\nPrivate student loans typically have variable interest rates while federal student loans have fixed rates. Consumers should be aware that some private loans require substantial up-front origination fees. These fees raise the real cost to the borrower and reduce the amount of money available for educational purposes.\\n\\nMost private loan programs are tied to one or more financial indexes, such as the Wall Street Journal Prime rate or the BBA LIBOR rate, plus an overhead charge. Because private loans are based on the credit history of the applicant, the overhead charge will vary. Students and families with excellent credit will generally receive lower rates and smaller loan origination fees than those with less than perfect credit. Money paid toward interest is now tax deductible. However, lenders rarely give complete details of the terms of the private student loan until after the student submits an application, in part because this helps prevent comparisons based on cost. For example, many lenders will only advertise the lowest interest rate they charge (for good credit borrowers). Borrowers with bad credit can expect interest rates that are as much as 6% higher, loan fees that are as much as 9% higher, and loan limits that are two-thirds lower than the advertised figures.[3]\\n\\nPrivate student loan fees\\nPrivate loans often carry an origination fee. Origination fees are a one-time charge based on the amount of the loan. They can be taken out of the total loan amount or added on top of the total loan amount, often at the borrower's preference. Some lenders offer low-interest, 0-fee loans. Each percentage point on the front-end fee gets paid once, while each percentage point on the interest rate is calculated and paid throughout the life of the loan. Some have suggested that this makes the interest rate more critical than the origination fee.\\n\\nIn fact, there is an easy solution to the fee-vs.-rate question: All lenders are legally required to provide you a statement of the \\\"APR (Annual Percentage Rate)\\\" for the loan before you sign a promissory note and commit to it. Unlike the \\\"base\\\" rate, this rate includes any fees charged and can be thought of as the \\\"effective\\\" interest rate including actual interest, fees, etc. When comparing loans, it may be easier to compare APR rather than \\\"rate\\\" to ensure an apples-to-apples comparison. APR is the best yardstick to compare loans that have the same repayment term; however, if the repayment terms are different, APR becomes a less-perfect comparison tool. With different term loans, consumers often look to 'total financing costs' to understand their financing options.\\n\\nEligible loan programs generally issue loans based on the credit history of the applicant and any applicable cosigner/co-endorser/coborrower. This is in contrast to federal loan programs that deal primarily with need-based criteria, as defined by the EFC and the FAFSA. For many students, this is a great advantage to private loan programs, as their families may have too much income or too many assets to qualify for federal aid but insufficient assets and income to pay for school without assistance.\\n\\nAdditionally, many international students in the United States can obtain private loans (they are ineligible for federal loans in many cases) with a cosigner who is a United States citizen or permanent resident. However, some graduate programs (notably top MBA programs) have a tie-up with private loan providers and in those cases no co-signor is needed even for international students.\\n\\nThe terms for private loans vary from lender to lender. A common suggestion is to shop around on ALL terms, not just respond to \\\"rates as low as...\\\" tactics that are sometimes little more than bait-and-switch. However, shopping around could damage your credit score.[4] Examples of other borrower terms and benefits that vary by lender are deferments (amount of time after leaving school before payments start) and forbearances (a period when payments are temporarily stopped due to financial or other hardship). These policies are solely based on the contract between lender and borrower and not set by Department of Education policies.\\nFederally subsidized consolidations are not available for private student loans,[5] though several lenders offer private consolidation programs. Borrowers of privately subsidized student loans may face the same restrictions to bankruptcy discharge as for government based loans: New legislation makes clear that these loans are, like federal student loans, not dischargeable under bankruptcy. Even before the legislation was passed, however, private student loans that were guaranteed 'in whole or in part' by a nonprofit entity are non-dischargeable in bankruptcy (and most private loans, regardless of the lender, were indeed guaranteed by a nonprofit).\\nDischarge of student loans\\n\\nUS Federal student loans and some private student loans can be discharged in bankruptcy only with a showing of \\\"undue hardship.\\\" Bankruptcy Code Section 523(a)(8) determines what loans can and can not be discharged. The undue hardship standard varies from jurisdiction to jurisdiction, but is generally difficult to meet, making student loans practically non-dischargeable through bankruptcy. While US Federal student loans can be discharged for total and permanent disability, private student loans cannot be discharged outside of bankruptcy.\",\"primaryKey\":[\"ProductId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"name\":\"ProductId\",\"attributeReference\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"ProductId\"},\"dataType\":\"long\"},{\"type\":\"Existing\",\"name\":\"EducationLoanAutomaticPaymentInterestRateReductionPercentage\",\"attributeReference\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanAutomaticPaymentInterestRateReductionPercentage\"},\"dataType\":\"decimal\",\"dataTypeLength\":18,\"scale\":8},{\"type\":\"Existing\",\"name\":\"EducationLoanNoticeOfLoanGuaranteeAndDisclosureStatement\",\"attributeReference\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanNoticeOfLoanGuaranteeAndDisclosureStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"EducationLoanEligibilityRequirementStatement\",\"attributeReference\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanEligibilityRequirementStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"EducationLoanDefermentStatement\",\"attributeReference\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanDefermentStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"ForbearanceStatement\",\"attributeReference\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"ForbearanceStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"RepaymentPlanTypeId\",\"attributeReference\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"RepaymentPlanTypeId\"},\"dataType\":\"integer\"},{\"type\":\"Existing\",\"name\":\"EducationLoanTypeId\",\"attributeReference\":{\"entity\":\"EducationLoanProduct.cdm.json/EducationLoanProduct\",\"name\":\"EducationLoanTypeId\"},\"dataType\":\"integer\"}]}}}",
			"Description": "A loan issued for the purpose of financing education expenses, primarily college education.\n\nThey come in several varieties in the United States:\n\n- Federal student loans made to students directly: No payments while enrolled in at least half time status. If a student drops below half time status, the account will go into its 6 month grace period. If the student re-enrolls in at least half time status, the loans will be deferred, but when they drop below half time again they will no longer have their grace period. Amounts are quite limited as well.\n\n- Federal student loans made to parents: Much higher limit, but payments start immediately\n\n- Private student loans made to students or parents: Higher limits and no payments until after graduation, although interest will start to accrue immediately. Private loans may be used for any education related expenses such as tuition, room and board, books, computers, and past due balances. Private loans can also be used to supplement federal student loans, when federal loans, grants and other forms of financial aid are not sufficient to cover the full cost of higher education.\n\nFederal loans to students\n- Federal Perkins Loan\n- Stafford loan\n- Federal Family Education Loans\n- Ford Direct Student Loans\n- Federal student loan consolidation\n\nFederal student loans in the United States are authorized under Title IV of the Higher Education Act as amended.\n\nThese loans are available to college and university students via funds disbursed directly to the school and are used to supplement personal and family resources, scholarships, grants, and work-study. They may be subsidized by the U.S. Government or may be unsubsidized depending on the student's financial need.\n\nBoth subsidized and unsubsidized loans are guaranteed by the U.S. Department of Education either directly or through guaranty agencies. Nearly all students are eligible to receive federal loans.  Both types offer a grace period of six months, which means that no payments are due until six months after graduation or after the borrower becomes a less-than-half-time student without graduating. Both types have a fairly modest annual limit. The dependent undergraduate limit effective for loans disbursed on or after July 1, 2008 is as follows (combined subsidized and unsubsidized limits): $5,500 per year for freshman undergraduate students, $6,500 for sophomore undergraduates, and $7,500 per year for junior and senior undergraduate students, as well as students enrolled in teacher certification or preparatory coursework for graduate programs. For independent undergraduates, the limits (combined subsidized and unsubsidized) effective for loans disbursed on or after July 1, 2008 are higher: $9,500 per year for freshman undergraduate students, $10,500 for sophomore undergraduates, and $12,500 per year for junior and senior undergraduate students, as well as students enrolled in teacher certification or preparatory coursework for graduate programs. Subsidized federal student loans are only offered to students with a demonstrated financial need. Financial need may vary from school to school. For these loans, the federal government makes interest payments while the student is in college. For example, those who borrow $10,000 during college will owe $10,000 upon graduation.\nUnsubsidized federal student loans are also guaranteed by the U.S. Government, but the government does not pay interest for the student, rather the interest accrues during college. Nearly all student are eligible for these loans regardless of demonstrated need. Those who borrow $10,000 during college will owe $10,000 plus interest upon graduation. For example, those who have borrowed $10,000 and had $2,000 accrue in interest will owe $12,000. Interest will begin accruing on the $12,000. The accrued interest will be \"capitalized\" into the loan amount, and the borrower will begin making payments on the accumulated total. Students can choose to pay the interest while still in college; however, few students choose to exercise this option.\n\nFederal student loans for graduate students have higher limits: $8,500 for subsidized Stafford and $12,500 (limits may differ for certain courses of study) for unsubsidized Stafford. Many students also take advantage of the Federal Perkins Loan. For graduate students the limit for Perkins is $6,000 per year.\n\nFederal student loans to parents\nUsually these are PLUS loans (formerly standing for \"Parent Loan for Undergraduate Students\"). Unlike loans made to students, parents can borrow much more - usually enough to cover any gap in the cost of education. However, there is no grace period: Payments start immediately.\nParents should be aware that they are responsible for repayment on these loans, not the student. This is not a 'cosigner' loan with the student having equal accountability. The parents have signed the master promissory note to pay and, if they do not do so, it is their credit rating that suffers. Also, parents are advised to consider \"year 4\" payments, rather than \"year 1\" payments. What sounds like a \"manageable\" debt load of $200 a month in freshman year can mushroom to a much more daunting $800 a month by the time four years have been funded through loans. The combination of immediate repayment and the ability to borrow substantial sums can be expensive.\nUnder new legislation, graduate students are eligible to receive PLUS loans in their own names. These Graduate PLUS loans have the same interest rates and terms of Parent PLUS loans.\n\nParents should also be aware that legislation raised the interest rate on these loans significantly - to 8.5% on July 1, 2006.\n\nThere are two distribution channels for federal student loans: Federal Direct Student Loans and Federal Family Education Loans.\n\n- Federal Direct Student Loans, also known as Direct Loans or FDLP loans, are funded from public capital originating with the U.S. Treasury. FDLP loans are distributed through a channel that begins with the U.S. Treasury Department and from there passes through the U.S. Department of Education, then to the college or university and then to the student.\n\n- Federal Family Education Loan Program loans, also known as FFEL loans or FFELP loans, are funded with private capital provided by banking institutions (i.e., banks, savings and loans, and credit unions). Because the FFELP loans use private capital as their source, students who use FFELP loans are able to take advantage of payment options that are similar to those available to customers who take out a home loan or a consumer loan. For example, some institutions will allow a discount for automatic payments or a series of on-time payments. In 2005, approximately two-thirds of all federally subsidized student loans were FFELP.\nAccording to the U.S. Department of Education, more than 6,000 colleges, universities, and technical schools participate in FFELP, which represents about 80% of all schools. FFELP lending represents 75% of all federal student loan volume.\n\nThe maximum amount that any student can borrow is adjusted from time to time as federal policies change. A study published in the winter 1996 edition of the Journal of Student Financial Aid, \"How Much Student Loan Debt Is Too Much?\" suggested that the monthly student debt payment for the average undergraduate should not exceed 8% of total monthly income after graduation. Some financial aid advisers have referred this as \"the 8% rule.\" Circumstances vary for individuals, so the 8% level is an indicator, not a rule set in stone. A research report about the 8% level is available at [1].\nPrivate student loans\n\nThese are loans that are not guaranteed by a government agency and are made to students by banks or finance companies. Advocates of private student loans suggest that they combine the best elements of the different government loans into one: They generally offer higher loan limits than federal student loans, ensuring the student is not left with a budget gap. But unlike federal parent loans, they generally offer a grace period with no payments due until after graduation (this grace period ranges as high as 12 months after graduation, though most private lenders offer six months). However, some higher education advocates are private loan detractors because of the higher interest rates, multiple fees, and lack of borrower protections private loans carry that are not associated with federal loans. \nPrivate student loan types\n\nPrivate loans generally come in two types: school-channel and direct-to-consumer.\n\nSchool-channel loans offer borrowers lower interest rates but generally take longer to process. School-channel loans are 'certified' by the school, which means the school signs off on the borrowing amount, and the funds for school-channel loans are disbursed directly to the school.\n\nDirect-to-consumer private loans are not certified by the school; schools don't interact with a direct-to-consumer private loan at all. The student simply supplies enrollment verification to the lender, and the loan proceeds are disbursed directly to the student. While direct-to-consumer loans generally carry higher interest rates than school-channel loans, they do allow families to get access to funds very quickly - in some cases, in a matter of days. Some argue that this convenience is offset by the risk of student over-borrowing and/or use of funds for inappropriate purposes, since there is no third-party certification that the amount of the loan is appropriate for the education finance needs of the student in question.\n\nDirect-to-consumer private loans are the fastest growing segment of education finance and under legislative scrutiny due to the lack of school certification. Loan providers range from large education finance companies to specialty companies that focus exclusively on this niche. Such loans will often be distinguished by the indication that \"no FAFSA is required\" or \"Funds disbursed directly to you.\"\n\nPrivate student loan rates and interest\nPrivate student loans typically have variable interest rates while federal student loans have fixed rates. Consumers should be aware that some private loans require substantial up-front origination fees. These fees raise the real cost to the borrower and reduce the amount of money available for educational purposes.\n\nMost private loan programs are tied to one or more financial indexes, such as the Wall Street Journal Prime rate or the BBA LIBOR rate, plus an overhead charge. Because private loans are based on the credit history of the applicant, the overhead charge will vary. Students and families with excellent credit will generally receive lower rates and smaller loan origination fees than those with less than perfect credit. Money paid toward interest is now tax deductible. However, lenders rarely give complete details of the terms of the private student loan until after the student submits an application, in part because this helps prevent comparisons based on cost. For example, many lenders will only advertise the lowest interest rate they charge (for good credit borrowers). Borrowers with bad credit can expect interest rates that are as much as 6% higher, loan fees that are as much as 9% higher, and loan limits that are two-thirds lower than the advertised figures.[3]\n\nPrivate student loan fees\nPrivate loans often carry an origination fee. Origination fees are a one-time charge based on the amount of the loan. They can be taken out of the total loan amount or added on top of the total loan amount, often at the borrower's preference. Some lenders offer low-interest, 0-fee loans. Each percentage point on the front-end fee gets paid once, while each percentage point on the interest rate is calculated and paid throughout the life of the loan. Some have suggested that this makes the interest rate more critical than the origination fee.\n\nIn fact, there is an easy solution to the fee-vs.-rate question: All lenders are legally required to provide you a statement of the \"APR (Annual Percentage Rate)\" for the loan before you sign a promissory note and commit to it. Unlike the \"base\" rate, this rate includes any fees charged and can be thought of as the \"effective\" interest rate including actual interest, fees, etc. When comparing loans, it may be easier to compare APR rather than \"rate\" to ensure an apples-to-apples comparison. APR is the best yardstick to compare loans that have the same repayment term; however, if the repayment terms are different, APR becomes a less-perfect comparison tool. With different term loans, consumers often look to 'total financing costs' to understand their financing options.\n\nEligible loan programs generally issue loans based on the credit history of the applicant and any applicable cosigner/co-endorser/coborrower. This is in contrast to federal loan programs that deal primarily with need-based criteria, as defined by the EFC and the FAFSA. For many students, this is a great advantage to private loan programs, as their families may have too much income or too many assets to qualify for federal aid but insufficient assets and income to pay for school without assistance.\n\nAdditionally, many international students in the United States can obtain private loans (they are ineligible for federal loans in many cases) with a cosigner who is a United States citizen or permanent resident. However, some graduate programs (notably top MBA programs) have a tie-up with private loan providers and in those cases no co-signor is needed even for international students.\n\nThe terms for private loans vary from lender to lender. A common suggestion is to shop around on ALL terms, not just respond to \"rates as low as...\" tactics that are sometimes little more than bait-and-switch. However, shopping around could damage your credit score.[4] Examples of other borrower terms and benefits that vary by lender are deferments (amount of time after leaving school before payments start) and forbearances (a period when payments are temporarily stopped due to financial or other hardship). These policies are solely based on the contract between lender and borrower and not set by Department of Education policies.\nFederally subsidized consolidations are not available for private student loans,[5] though several lenders offer private consolidation programs. Borrowers of privately subsidized student loans may face the same restrictions to bankruptcy discharge as for government based loans: New legislation makes clear that these loans are, like federal student loans, not dischargeable under bankruptcy. Even before the legislation was passed, however, private student loans that were guaranteed 'in whole or in part' by a nonprofit entity are non-dischargeable in bankruptcy (and most private loans, regardless of the lender, were indeed guaranteed by a nonprofit).\nDischarge of student loans\n\nUS Federal student loans and some private student loans can be discharged in bankruptcy only with a showing of \"undue hardship.\" Bankruptcy Code Section 523(a)(8) determines what loans can and can not be discharged. The undue hardship standard varies from jurisdiction to jurisdiction, but is generally difficult to meet, making student loans practically non-dischargeable through bankruptcy. While US Federal student loans can be discharged for total and permanent disability, private student loans cannot be discharged outside of bankruptcy.",
			"DisplayFolderInfo": "{\"name\":\"Product\",\"colorCode\":\"#0E3D73\"}",
			"PrimaryKeys": "ProductId",
			"spark.sql.sources.provider": "csv"
		},
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false
	},
	"type": "TABLE"
}