{
	"name": "LetterOfCreditProduct",
	"properties": {
		"Namespace": {
			"DatabaseName": "banking"
		},
		"Name": "LetterOfCreditProduct",
		"Description": "Letters of credit are commonly used to reduce credit risk to sellers in both domestic and international sales arrangements. By having a bank issue a letter of credit, in essence, one is substituting the bank's credit worthiness for that of the customer.\n\nA commercial letter of credit is a contractual agreement between a bank (\"Issuing bank\") on behalf of one of its customers that authorizes another bank (\"advising or confirming bank\") to make payment to the beneficiary. \n\nThe issuing bank at the request of its customer opens the letter of credit. The issuing bank commits to honor drawings made under the letter of credit.  The beneficiary is normally the provider of goods or services. Letters of credit substitute the credit of a bank for that of the customer to facilitate trade.\n\nThere are two primary types of letters of credit:  commercial and standby. The commercial letter of credit is the primary payment mechanism for a transaction and the standby letter of credit is a secondary payment mechanism.\n\nLetters of credit used in international transactions are governed by the International Chamber of Commerce Uniform Customs and Practice for Documentary Credits. The general provisions and definitions of the International Chamber of Commerce are binding on all parties. In the US, domestic collections are governed by the Uniform Commercial Code.\n\nA letter of credit arrangement has a basic structure:\n\n-  A payment undertaken by a bank (\"Issuing Bank\") that is on behalf of a buyer (\"the applicant\").\n\n-  The issuing banks agrees to pay a seller (\"beneficiary\") a set amount upon the presentation of predefined documents and/or terms and conditions with a specified time limit.\n\n-  The documents must conform to terms and conditions set out in the letter of credit\n\n-  Documents to be presented at a specified place \n\n-  The Beneficiary is entitled to be paid the agreed amount as long as he can provide the documents required by the letter of credit at the indicated place and within the timeframe defined.\n\n-  All of the parties deal in the documents and the not the associated goods and services.\n\n-  The issuing bank's obligation to the buyer is to examine all documents and insure that the terms and conditions of the letter of credit have been met.    If the beneficiary conforms to the letter of credit terms and conditions then they are paid by the bank.\n\n-  The issuing bank's liability to pay and be reimbursed by their customer becomes binding upon the completion of all terms and conditions of the letter of credit.\n\n-  The \"advising bank\" is there to advise the beneficiary and has no other obligation under the letter of credit.\n\n-  The 'confirming bank\" confirms the letter of credit to the beneficiary.   The \"confirming bank\" is also usually the \"advising bank\".\n\n-  The letter of credit is negotiable and must include an unconditional promise to pay on demand or at a definite time in the future.\n\nThe following is a representative example of a typical letter of credit procedure:\n\n1.  Two parties (buyer and seller) agree to conduct a business arrangement.\n2.  The seller requests a letter of credit to guarantee payment.\n3.  Buyer requires a letter of credit in favor of the seller from his bank.\n4.  Buyer's bank approves letter of credit based on credit risk of buyer.\n5.  Buyer's bank forward letter of credit to advising or confirming bank.\n6.  Advising bank authenticates letter of credit and forwards it to seller.\n7.  Seller ships goods or performed services\n8.  Seller provides documents required by letter of credit\n9.  Advising or confirming bank checks documents and terms of conditions of letter of credit\n10.  If documents are correct, the advising or confirming bank will claim funds by debiting the account of the issuing bank or as required\n11.  Advising or confirming bank will forward documents to the issuing bank\n12.  Issuing bank will examine documents for compliance to letter of credit\n13.  Issuing bank forward documents to buyer\n\nDocumentary letters of credit can be either Revocable or Irrevocable, although the first is extremely rare. Irrevocable letters of credit can be Confirmed or Not Confirmed.\n\n Each type of credit has advantages and disadvantages for the buyer and for the seller, which this information will review below. Charges for each type will also vary. However, the more the banks assume risk by guaranteeing payment, the more they will charge for providing the service.\n\nThe beneficiary of a letter of credit may assign all or part of the proceeds under a credit to a third party (the assignee). However, unlike a transferred credit, the beneficiary maintains sole rights to the credit and is solely responsible for complying with its terms and conditions. \n\nFor the assignee, an assignment only means that the paying bank, once it receives notice of the assignment, undertakes to follow the assignment instructions, if and when payment is made. The assignee is dependent upon the beneficiary for compliance, and thus this arrangement is riskier than a transferred credit.  \n\nMost problems result from the seller's inability to fulfill obligations stated in the letter of credit. The seller may find these terms difficult or impossible to fulfill and, either tries to fulfill them and fails, or asks the buyer to amend to the letter of credit. As most letters of credit are irrevocable, amendments may at times be difficult since both the buyer and the seller must agree.\n\nSellers may have one or more of the following problems:\n\n- The shipment schedule cannot be met;\n\n- The stipulations concerning freight costs are unacceptable;\n\n- The price becomes too low due to exchange rates fluctuations;\n\n- The quantity of product ordered is not the expected amount;\n\n- The description of product is either insufficient or too detailed; and,\n\n- The stipulated documents are difficult or impossible to obtain.\n\nEven when sellers accept the terms of a letter of credit, problems often arise late in the process. When this occurs, the buyer's and seller's banks will try to negotiate any differences. In some cases, the seller can correct the documents and present them within the time specified in the letter of credit. \n\nIf the documents cannot be corrected, the advising bank will ask the issuing bank to accept the documents despite the discrepancies found. It is important to note that, if the documents are not in accord with the specifications of the letter of credit, the buyer's issuing bank is no longer obligated to pay.\n\nThe letter of credit process has been standardized by a set of rules published by the International Chamber of Commerce (ICC). These rules are called the Uniform Customs and Practice for Documentary Credits (UCP) and are contained in ICC Publication No. 500. The following is the basic set of steps used in a letter of credit transaction. Specific letter of credit transactions follow somewhat different procedures.\n\n1. After the buyer and seller agree on the terms of a sale, the buyer arranges for his bank to open a letter of credit in favor of the seller. Note: The buyer will need to have a line of credit established at the bank or provide cash collateral for the amount of the letter of credit.\n\n2. The buyer's issuing bank prepares the letter of credit, including all of the buyer's instructions to the seller concerning shipment and required documentation.\n\n3. The buyer's bank sends the letter of credit to the seller's advising bank.\n\n4. The seller's advising bank forwards the letter of credit to the seller.\n\n5. The seller carefully reviews all conditions stipulated in the letter of credit. If the seller cannot comply with any of the provisions, it will ask the buyer to amend the letter of credit.\n\n6. After final terms are agreed upon, the seller ships the goods to the appropriate port or location.\n\n7. After shipping the goods, the seller obtains the required documents. Please note that the seller may have to obtain some documents prior to shipment.\n\n8. The seller presents the documents to its advising bank along with a draft for payment.\n\n9. The seller's advising bank reviews the documents. If they are in order, it will forward them to the buyer's issuing bank. If a confirmed letter of credit, the advising bank will pay the seller (cash or a bankers' acceptance).\n\n10. Once the buyer's issuing bank receives and reviews the documents, it either (1) pays if there are no discrepancies; or (2) forwards the documents to the buyer if there are discrepancies for its review and approval.\n\nThe seller requests a modification or amendment of questionable terms in the letter of credit;\n\nIf the buyer and issuing bank agree to the changes, the issuing bank will change the letter of credit;\n\nThe buyer's issuing bank notifies the seller's advising bank of the amendment; and\n\nThe seller's advising bank notifies the seller of the amendment. \n\nBasic considerations for buyers and sellers of letters of credit:\n\nSeller\n1. Before signing a sales contract, the seller should make inquiries about the buyer's creditworthiness and business practices. The seller's bank will generally assist in this investigation.\n\n2. In many cases, the issuing bank will specify the advising and/or confirming bank. These designations are usually based on the issuing bank's established correspondent relationships. The seller should ensure that the advising/confirming bank is a financially sound institution.\n\n3. The seller should confirm the good standing of the buyer's issuing bank if the letter of credit is unconfirmed.\n\n4. For confirmed letters of credit, the seller's advising bank should be willing to confirm the letter of credit issued by the buyer's bank. If the advising bank refuses to do so, the seller should request another issuing bank as the current bank may be or is in the process of becoming insolvent.\n\n5. The seller should carefully review the letter of credit to ensure its conditions can be met. All documents must conform to the terms of the letter of credit. The seller must comply with every detail of the letter of credit specifications; otherwise the security given by the credit is lost.\n\n6. The seller should ensure that the letter of credit is irrevocable.\n\n7. If amendments are necessary, the seller should contact the buyer immediately so that the buyer can instruct the issuing bank to make the necessary changes quickly. The seller should keep the letter of credit's expiration date in mind throughout the amendment process.\n\n8. The seller should confirm with the insurance company that it can provide the coverage specified in the letter of credit and that insurance charges listed in the letter of credit are correct. Typical insurance coverage is for CIF (cost, insurance and freight) often the value of the goods plus about 10 percent.\n\n9. The seller must ensure that the goods match the description in the letter of credit and the invoice description.\n\n10. The seller should be familiar with foreign exchange limitations in the buyer's country that could hinder payment procedures.\n\nBuyer\n1. When choosing the type of letter of credit, the buyer should consider the standard payment methods in the seller's country.\n\n2. The buyer should keep the details of the purchase short and concise.\n\n3. The buyer should be prepared to amend or re-negotiate terms of the letter of credit with the seller. This is a common procedure in international trade. With irrevocable letters of credit, the most common type, all parties must agree to amend the document.\n\n4. The buyer can reduce the foreign exchange risk by buying forward currency contracts.\n\n5. The buyer should use a bank experienced in foreign trade as its issuing bank.\n\n6. The validation time stated on the letter of credit should give the seller ample time to produce the goods or to pull them out of stock.\n\n7. A letter of credit is not fail-safe. Banks are only responsible for the documents exchanged and not the goods shipped. Documents in conformity with the letter of credit specifications cannot be rejected on grounds that the goods were not delivered as specified in the contract. The goods shipped may not in fact be the goods ordered and paid for.\n\n8. Purchase contracts and other agreements pertaining to the sale between the buyer and seller are not the concern of the issuing bank. Only the letter of credit terms are binding on the bank.\n\n9. Documents specified in the letter of credit should include those the buyer requires for customs clearance.",
		"EntityType": "TABLE",
		"TableType": "EXTERNAL",
		"Origin": {
			"Type": "SPARK"
		},
		"StorageDescriptor": {
			"Columns": [
				{
					"Name": "ProductId",
					"Description": "The unique identifier of a Product.",
					"BaseAttributeReference": {
						"Entity": "LetterOfCreditProduct.cdm.json/LetterOfCreditProduct",
						"Name": "ProductId"
					},
					"OriginDataTypeName": {
						"TypeName": "long",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "long"
						}
					}
				},
				{
					"Name": "LetterOfCreditTermsAndConditionsStatement",
					"Description": "A statement describing the terms and conditions associated with the letter of credit.",
					"BaseAttributeReference": {
						"Entity": "LetterOfCreditProduct.cdm.json/LetterOfCreditProduct",
						"Name": "LetterOfCreditTermsAndConditionsStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "LetterOfCreditTypeId",
					"Description": "The unique identifier of a letter of credit type.",
					"BaseAttributeReference": {
						"Entity": "LetterOfCreditProduct.cdm.json/LetterOfCreditProduct",
						"Name": "LetterOfCreditTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "TypeOfPaymentStatement",
					"Description": "The type of payment applied to the letter of credit.\n\nThe buyer and seller may agree to use sight drafts, time drafts, or some sort of deferred payment mechanism.",
					"BaseAttributeReference": {
						"Entity": "LetterOfCreditProduct.cdm.json/LetterOfCreditProduct",
						"Name": "TypeOfPaymentStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "DesiredDocumentsStatement",
					"Description": "A statement of the required documents (see LETTER OF CREDIT REQUIRED DOCUMENT).\n\nThe buyer specifies the necessary documents. Buyers can list, for example, a bill of lading, a commercial invoice, a certificate of origin, certificates of analysis, etc. The seller must agree to all documentary requirements or suggest an amendment to the letter of credit.",
					"BaseAttributeReference": {
						"Entity": "LetterOfCreditProduct.cdm.json/LetterOfCreditProduct",
						"Name": "DesiredDocumentsStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "DescriptionOfGoodsStatement",
					"Description": "A statement of the description of goods covered by the letter of credit.\n\nThe seller should provide a short and precise description of the goods as well as the quantity involved.",
					"BaseAttributeReference": {
						"Entity": "LetterOfCreditProduct.cdm.json/LetterOfCreditProduct",
						"Name": "DescriptionOfGoodsStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "ConfirmationOfOrderStatement",
					"Description": "A statement regarding any confirmations that must accompany the letter of credit.\n\nWith international arrangements, the seller may wish to confirm the letter of credit with a bank in its country.",
					"BaseAttributeReference": {
						"Entity": "LetterOfCreditProduct.cdm.json/LetterOfCreditProduct",
						"Name": "ConfirmationOfOrderStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "AssignmentOfProceedsStatement",
					"Description": "A statement detailing any assignment of proceeds terms and conditions associated with the letter of credit.\n\nThe beneficiary of a letter of credit may assign all or part of the proceeds under a credit to a third party (the assignee). However, unlike a transferred credit, the beneficiary maintains sole rights to the credit and is solely responsible for complying with its terms and conditions. \n\nFor the assignee, an assignment only means that the paying bank, once it receives notice of the assignment, undertakes to follow the assignment instructions, if and when payment is made. \n\nThe assignee is dependent upon the beneficiary for compliance, and thus this arrangement is riskier than a transferred credit. Before agreeing to an assignment of proceeds arrangement, the assignee should carefully review the original letter of credit.",
					"BaseAttributeReference": {
						"Entity": "LetterOfCreditProduct.cdm.json/LetterOfCreditProduct",
						"Name": "AssignmentOfProceedsStatement"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "IsoCurrencyCode",
					"Description": "The ISO 4217 currency code.",
					"BaseAttributeReference": {
						"Entity": "LetterOfCreditProduct.cdm.json/LetterOfCreditProduct",
						"Name": "IsoCurrencyCode"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 3,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				}
			],
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://dpu@adlsgen2deepu.dfs.core.windows.net/dpu_json_test/LetterOfCreditProduct",
					"delimiter": ",",
					"multiLine": "false",
					"firstRowAsHeader": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://dpu@adlsgen2deepu.dfs.core.windows.net/dpu_json_test/LetterOfCreditProduct",
				"Properties": {
					"LinkedServiceName": "wspc-dpu-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "{\"type\":\"None\",\"level\":\"optimal\"}",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"ProductId\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"ProductId\"},\"LetterOfCreditTermsAndConditionsStatement\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"LetterOfCreditTermsAndConditionsStatement\"},\"LetterOfCreditTypeId\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"LetterOfCreditTypeId\"},\"TypeOfPaymentStatement\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"TypeOfPaymentStatement\"},\"DesiredDocumentsStatement\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"DesiredDocumentsStatement\"},\"DescriptionOfGoodsStatement\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"DescriptionOfGoodsStatement\"},\"ConfirmationOfOrderStatement\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"ConfirmationOfOrderStatement\"},\"AssignmentOfProceedsStatement\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"AssignmentOfProceedsStatement\"},\"IsoCurrencyCode\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"IsoCurrencyCode\"}}}"
			},
			"Compressed": false,
			"IsStoredAsSubdirectories": false
		},
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"LetterOfCreditProduct\",\"path\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\"},\"description\":\"Letters of credit are commonly used to reduce credit risk to sellers in both domestic and international sales arrangements. By having a bank issue a letter of credit, in essence, one is substituting the bank's credit worthiness for that of the customer.\\n\\nA commercial letter of credit is a contractual agreement between a bank (\\\"Issuing bank\\\") on behalf of one of its customers that authorizes another bank (\\\"advising or confirming bank\\\") to make payment to the beneficiary. \\n\\nThe issuing bank at the request of its customer opens the letter of credit. The issuing bank commits to honor drawings made under the letter of credit.  The beneficiary is normally the provider of goods or services. Letters of credit substitute the credit of a bank for that of the customer to facilitate trade.\\n\\nThere are two primary types of letters of credit:  commercial and standby. The commercial letter of credit is the primary payment mechanism for a transaction and the standby letter of credit is a secondary payment mechanism.\\n\\nLetters of credit used in international transactions are governed by the International Chamber of Commerce Uniform Customs and Practice for Documentary Credits. The general provisions and definitions of the International Chamber of Commerce are binding on all parties. In the US, domestic collections are governed by the Uniform Commercial Code.\\n\\nA letter of credit arrangement has a basic structure:\\n\\n-  A payment undertaken by a bank (\\\"Issuing Bank\\\") that is on behalf of a buyer (\\\"the applicant\\\").\\n\\n-  The issuing banks agrees to pay a seller (\\\"beneficiary\\\") a set amount upon the presentation of predefined documents and/or terms and conditions with a specified time limit.\\n\\n-  The documents must conform to terms and conditions set out in the letter of credit\\n\\n-  Documents to be presented at a specified place \\n\\n-  The Beneficiary is entitled to be paid the agreed amount as long as he can provide the documents required by the letter of credit at the indicated place and within the timeframe defined.\\n\\n-  All of the parties deal in the documents and the not the associated goods and services.\\n\\n-  The issuing bank's obligation to the buyer is to examine all documents and insure that the terms and conditions of the letter of credit have been met.    If the beneficiary conforms to the letter of credit terms and conditions then they are paid by the bank.\\n\\n-  The issuing bank's liability to pay and be reimbursed by their customer becomes binding upon the completion of all terms and conditions of the letter of credit.\\n\\n-  The \\\"advising bank\\\" is there to advise the beneficiary and has no other obligation under the letter of credit.\\n\\n-  The 'confirming bank\\\" confirms the letter of credit to the beneficiary.   The \\\"confirming bank\\\" is also usually the \\\"advising bank\\\".\\n\\n-  The letter of credit is negotiable and must include an unconditional promise to pay on demand or at a definite time in the future.\\n\\nThe following is a representative example of a typical letter of credit procedure:\\n\\n1.  Two parties (buyer and seller) agree to conduct a business arrangement.\\n2.  The seller requests a letter of credit to guarantee payment.\\n3.  Buyer requires a letter of credit in favor of the seller from his bank.\\n4.  Buyer's bank approves letter of credit based on credit risk of buyer.\\n5.  Buyer's bank forward letter of credit to advising or confirming bank.\\n6.  Advising bank authenticates letter of credit and forwards it to seller.\\n7.  Seller ships goods or performed services\\n8.  Seller provides documents required by letter of credit\\n9.  Advising or confirming bank checks documents and terms of conditions of letter of credit\\n10.  If documents are correct, the advising or confirming bank will claim funds by debiting the account of the issuing bank or as required\\n11.  Advising or confirming bank will forward documents to the issuing bank\\n12.  Issuing bank will examine documents for compliance to letter of credit\\n13.  Issuing bank forward documents to buyer\\n\\nDocumentary letters of credit can be either Revocable or Irrevocable, although the first is extremely rare. Irrevocable letters of credit can be Confirmed or Not Confirmed.\\n\\n Each type of credit has advantages and disadvantages for the buyer and for the seller, which this information will review below. Charges for each type will also vary. However, the more the banks assume risk by guaranteeing payment, the more they will charge for providing the service.\\n\\nThe beneficiary of a letter of credit may assign all or part of the proceeds under a credit to a third party (the assignee). However, unlike a transferred credit, the beneficiary maintains sole rights to the credit and is solely responsible for complying with its terms and conditions. \\n\\nFor the assignee, an assignment only means that the paying bank, once it receives notice of the assignment, undertakes to follow the assignment instructions, if and when payment is made. The assignee is dependent upon the beneficiary for compliance, and thus this arrangement is riskier than a transferred credit.  \\n\\nMost problems result from the seller's inability to fulfill obligations stated in the letter of credit. The seller may find these terms difficult or impossible to fulfill and, either tries to fulfill them and fails, or asks the buyer to amend to the letter of credit. As most letters of credit are irrevocable, amendments may at times be difficult since both the buyer and the seller must agree.\\n\\nSellers may have one or more of the following problems:\\n\\n- The shipment schedule cannot be met;\\n\\n- The stipulations concerning freight costs are unacceptable;\\n\\n- The price becomes too low due to exchange rates fluctuations;\\n\\n- The quantity of product ordered is not the expected amount;\\n\\n- The description of product is either insufficient or too detailed; and,\\n\\n- The stipulated documents are difficult or impossible to obtain.\\n\\nEven when sellers accept the terms of a letter of credit, problems often arise late in the process. When this occurs, the buyer's and seller's banks will try to negotiate any differences. In some cases, the seller can correct the documents and present them within the time specified in the letter of credit. \\n\\nIf the documents cannot be corrected, the advising bank will ask the issuing bank to accept the documents despite the discrepancies found. It is important to note that, if the documents are not in accord with the specifications of the letter of credit, the buyer's issuing bank is no longer obligated to pay.\\n\\nThe letter of credit process has been standardized by a set of rules published by the International Chamber of Commerce (ICC). These rules are called the Uniform Customs and Practice for Documentary Credits (UCP) and are contained in ICC Publication No. 500. The following is the basic set of steps used in a letter of credit transaction. Specific letter of credit transactions follow somewhat different procedures.\\n\\n1. After the buyer and seller agree on the terms of a sale, the buyer arranges for his bank to open a letter of credit in favor of the seller. Note: The buyer will need to have a line of credit established at the bank or provide cash collateral for the amount of the letter of credit.\\n\\n2. The buyer's issuing bank prepares the letter of credit, including all of the buyer's instructions to the seller concerning shipment and required documentation.\\n\\n3. The buyer's bank sends the letter of credit to the seller's advising bank.\\n\\n4. The seller's advising bank forwards the letter of credit to the seller.\\n\\n5. The seller carefully reviews all conditions stipulated in the letter of credit. If the seller cannot comply with any of the provisions, it will ask the buyer to amend the letter of credit.\\n\\n6. After final terms are agreed upon, the seller ships the goods to the appropriate port or location.\\n\\n7. After shipping the goods, the seller obtains the required documents. Please note that the seller may have to obtain some documents prior to shipment.\\n\\n8. The seller presents the documents to its advising bank along with a draft for payment.\\n\\n9. The seller's advising bank reviews the documents. If they are in order, it will forward them to the buyer's issuing bank. If a confirmed letter of credit, the advising bank will pay the seller (cash or a bankers' acceptance).\\n\\n10. Once the buyer's issuing bank receives and reviews the documents, it either (1) pays if there are no discrepancies; or (2) forwards the documents to the buyer if there are discrepancies for its review and approval.\\n\\nThe seller requests a modification or amendment of questionable terms in the letter of credit;\\n\\nIf the buyer and issuing bank agree to the changes, the issuing bank will change the letter of credit;\\n\\nThe buyer's issuing bank notifies the seller's advising bank of the amendment; and\\n\\nThe seller's advising bank notifies the seller of the amendment. \\n\\nBasic considerations for buyers and sellers of letters of credit:\\n\\nSeller\\n1. Before signing a sales contract, the seller should make inquiries about the buyer's creditworthiness and business practices. The seller's bank will generally assist in this investigation.\\n\\n2. In many cases, the issuing bank will specify the advising and/or confirming bank. These designations are usually based on the issuing bank's established correspondent relationships. The seller should ensure that the advising/confirming bank is a financially sound institution.\\n\\n3. The seller should confirm the good standing of the buyer's issuing bank if the letter of credit is unconfirmed.\\n\\n4. For confirmed letters of credit, the seller's advising bank should be willing to confirm the letter of credit issued by the buyer's bank. If the advising bank refuses to do so, the seller should request another issuing bank as the current bank may be or is in the process of becoming insolvent.\\n\\n5. The seller should carefully review the letter of credit to ensure its conditions can be met. All documents must conform to the terms of the letter of credit. The seller must comply with every detail of the letter of credit specifications; otherwise the security given by the credit is lost.\\n\\n6. The seller should ensure that the letter of credit is irrevocable.\\n\\n7. If amendments are necessary, the seller should contact the buyer immediately so that the buyer can instruct the issuing bank to make the necessary changes quickly. The seller should keep the letter of credit's expiration date in mind throughout the amendment process.\\n\\n8. The seller should confirm with the insurance company that it can provide the coverage specified in the letter of credit and that insurance charges listed in the letter of credit are correct. Typical insurance coverage is for CIF (cost, insurance and freight) often the value of the goods plus about 10 percent.\\n\\n9. The seller must ensure that the goods match the description in the letter of credit and the invoice description.\\n\\n10. The seller should be familiar with foreign exchange limitations in the buyer's country that could hinder payment procedures.\\n\\nBuyer\\n1. When choosing the type of letter of credit, the buyer should consider the standard payment methods in the seller's country.\\n\\n2. The buyer should keep the details of the purchase short and concise.\\n\\n3. The buyer should be prepared to amend or re-negotiate terms of the letter of credit with the seller. This is a common procedure in international trade. With irrevocable letters of credit, the most common type, all parties must agree to amend the document.\\n\\n4. The buyer can reduce the foreign exchange risk by buying forward currency contracts.\\n\\n5. The buyer should use a bank experienced in foreign trade as its issuing bank.\\n\\n6. The validation time stated on the letter of credit should give the seller ample time to produce the goods or to pull them out of stock.\\n\\n7. A letter of credit is not fail-safe. Banks are only responsible for the documents exchanged and not the goods shipped. Documents in conformity with the letter of credit specifications cannot be rejected on grounds that the goods were not delivered as specified in the contract. The goods shipped may not in fact be the goods ordered and paid for.\\n\\n8. Purchase contracts and other agreements pertaining to the sale between the buyer and seller are not the concern of the issuing bank. Only the letter of credit terms are binding on the bank.\\n\\n9. Documents specified in the letter of credit should include those the buyer requires for customs clearance.\",\"primaryKey\":[\"ProductId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"name\":\"ProductId\",\"attributeReference\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"ProductId\"},\"dataType\":\"long\"},{\"type\":\"Existing\",\"name\":\"LetterOfCreditTermsAndConditionsStatement\",\"attributeReference\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"LetterOfCreditTermsAndConditionsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"LetterOfCreditTypeId\",\"attributeReference\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"LetterOfCreditTypeId\"},\"dataType\":\"integer\"},{\"type\":\"Existing\",\"name\":\"TypeOfPaymentStatement\",\"attributeReference\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"TypeOfPaymentStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"DesiredDocumentsStatement\",\"attributeReference\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"DesiredDocumentsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"DescriptionOfGoodsStatement\",\"attributeReference\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"DescriptionOfGoodsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"ConfirmationOfOrderStatement\",\"attributeReference\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"ConfirmationOfOrderStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"AssignmentOfProceedsStatement\",\"attributeReference\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"AssignmentOfProceedsStatement\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"IsoCurrencyCode\",\"attributeReference\":{\"entity\":\"LetterOfCreditProduct.cdm.json/LetterOfCreditProduct\",\"name\":\"IsoCurrencyCode\"},\"dataType\":\"string\",\"dataTypeLength\":3}]}}}",
			"Description": "Letters of credit are commonly used to reduce credit risk to sellers in both domestic and international sales arrangements. By having a bank issue a letter of credit, in essence, one is substituting the bank's credit worthiness for that of the customer.\n\nA commercial letter of credit is a contractual agreement between a bank (\"Issuing bank\") on behalf of one of its customers that authorizes another bank (\"advising or confirming bank\") to make payment to the beneficiary. \n\nThe issuing bank at the request of its customer opens the letter of credit. The issuing bank commits to honor drawings made under the letter of credit.  The beneficiary is normally the provider of goods or services. Letters of credit substitute the credit of a bank for that of the customer to facilitate trade.\n\nThere are two primary types of letters of credit:  commercial and standby. The commercial letter of credit is the primary payment mechanism for a transaction and the standby letter of credit is a secondary payment mechanism.\n\nLetters of credit used in international transactions are governed by the International Chamber of Commerce Uniform Customs and Practice for Documentary Credits. The general provisions and definitions of the International Chamber of Commerce are binding on all parties. In the US, domestic collections are governed by the Uniform Commercial Code.\n\nA letter of credit arrangement has a basic structure:\n\n-  A payment undertaken by a bank (\"Issuing Bank\") that is on behalf of a buyer (\"the applicant\").\n\n-  The issuing banks agrees to pay a seller (\"beneficiary\") a set amount upon the presentation of predefined documents and/or terms and conditions with a specified time limit.\n\n-  The documents must conform to terms and conditions set out in the letter of credit\n\n-  Documents to be presented at a specified place \n\n-  The Beneficiary is entitled to be paid the agreed amount as long as he can provide the documents required by the letter of credit at the indicated place and within the timeframe defined.\n\n-  All of the parties deal in the documents and the not the associated goods and services.\n\n-  The issuing bank's obligation to the buyer is to examine all documents and insure that the terms and conditions of the letter of credit have been met.    If the beneficiary conforms to the letter of credit terms and conditions then they are paid by the bank.\n\n-  The issuing bank's liability to pay and be reimbursed by their customer becomes binding upon the completion of all terms and conditions of the letter of credit.\n\n-  The \"advising bank\" is there to advise the beneficiary and has no other obligation under the letter of credit.\n\n-  The 'confirming bank\" confirms the letter of credit to the beneficiary.   The \"confirming bank\" is also usually the \"advising bank\".\n\n-  The letter of credit is negotiable and must include an unconditional promise to pay on demand or at a definite time in the future.\n\nThe following is a representative example of a typical letter of credit procedure:\n\n1.  Two parties (buyer and seller) agree to conduct a business arrangement.\n2.  The seller requests a letter of credit to guarantee payment.\n3.  Buyer requires a letter of credit in favor of the seller from his bank.\n4.  Buyer's bank approves letter of credit based on credit risk of buyer.\n5.  Buyer's bank forward letter of credit to advising or confirming bank.\n6.  Advising bank authenticates letter of credit and forwards it to seller.\n7.  Seller ships goods or performed services\n8.  Seller provides documents required by letter of credit\n9.  Advising or confirming bank checks documents and terms of conditions of letter of credit\n10.  If documents are correct, the advising or confirming bank will claim funds by debiting the account of the issuing bank or as required\n11.  Advising or confirming bank will forward documents to the issuing bank\n12.  Issuing bank will examine documents for compliance to letter of credit\n13.  Issuing bank forward documents to buyer\n\nDocumentary letters of credit can be either Revocable or Irrevocable, although the first is extremely rare. Irrevocable letters of credit can be Confirmed or Not Confirmed.\n\n Each type of credit has advantages and disadvantages for the buyer and for the seller, which this information will review below. Charges for each type will also vary. However, the more the banks assume risk by guaranteeing payment, the more they will charge for providing the service.\n\nThe beneficiary of a letter of credit may assign all or part of the proceeds under a credit to a third party (the assignee). However, unlike a transferred credit, the beneficiary maintains sole rights to the credit and is solely responsible for complying with its terms and conditions. \n\nFor the assignee, an assignment only means that the paying bank, once it receives notice of the assignment, undertakes to follow the assignment instructions, if and when payment is made. The assignee is dependent upon the beneficiary for compliance, and thus this arrangement is riskier than a transferred credit.  \n\nMost problems result from the seller's inability to fulfill obligations stated in the letter of credit. The seller may find these terms difficult or impossible to fulfill and, either tries to fulfill them and fails, or asks the buyer to amend to the letter of credit. As most letters of credit are irrevocable, amendments may at times be difficult since both the buyer and the seller must agree.\n\nSellers may have one or more of the following problems:\n\n- The shipment schedule cannot be met;\n\n- The stipulations concerning freight costs are unacceptable;\n\n- The price becomes too low due to exchange rates fluctuations;\n\n- The quantity of product ordered is not the expected amount;\n\n- The description of product is either insufficient or too detailed; and,\n\n- The stipulated documents are difficult or impossible to obtain.\n\nEven when sellers accept the terms of a letter of credit, problems often arise late in the process. When this occurs, the buyer's and seller's banks will try to negotiate any differences. In some cases, the seller can correct the documents and present them within the time specified in the letter of credit. \n\nIf the documents cannot be corrected, the advising bank will ask the issuing bank to accept the documents despite the discrepancies found. It is important to note that, if the documents are not in accord with the specifications of the letter of credit, the buyer's issuing bank is no longer obligated to pay.\n\nThe letter of credit process has been standardized by a set of rules published by the International Chamber of Commerce (ICC). These rules are called the Uniform Customs and Practice for Documentary Credits (UCP) and are contained in ICC Publication No. 500. The following is the basic set of steps used in a letter of credit transaction. Specific letter of credit transactions follow somewhat different procedures.\n\n1. After the buyer and seller agree on the terms of a sale, the buyer arranges for his bank to open a letter of credit in favor of the seller. Note: The buyer will need to have a line of credit established at the bank or provide cash collateral for the amount of the letter of credit.\n\n2. The buyer's issuing bank prepares the letter of credit, including all of the buyer's instructions to the seller concerning shipment and required documentation.\n\n3. The buyer's bank sends the letter of credit to the seller's advising bank.\n\n4. The seller's advising bank forwards the letter of credit to the seller.\n\n5. The seller carefully reviews all conditions stipulated in the letter of credit. If the seller cannot comply with any of the provisions, it will ask the buyer to amend the letter of credit.\n\n6. After final terms are agreed upon, the seller ships the goods to the appropriate port or location.\n\n7. After shipping the goods, the seller obtains the required documents. Please note that the seller may have to obtain some documents prior to shipment.\n\n8. The seller presents the documents to its advising bank along with a draft for payment.\n\n9. The seller's advising bank reviews the documents. If they are in order, it will forward them to the buyer's issuing bank. If a confirmed letter of credit, the advising bank will pay the seller (cash or a bankers' acceptance).\n\n10. Once the buyer's issuing bank receives and reviews the documents, it either (1) pays if there are no discrepancies; or (2) forwards the documents to the buyer if there are discrepancies for its review and approval.\n\nThe seller requests a modification or amendment of questionable terms in the letter of credit;\n\nIf the buyer and issuing bank agree to the changes, the issuing bank will change the letter of credit;\n\nThe buyer's issuing bank notifies the seller's advising bank of the amendment; and\n\nThe seller's advising bank notifies the seller of the amendment. \n\nBasic considerations for buyers and sellers of letters of credit:\n\nSeller\n1. Before signing a sales contract, the seller should make inquiries about the buyer's creditworthiness and business practices. The seller's bank will generally assist in this investigation.\n\n2. In many cases, the issuing bank will specify the advising and/or confirming bank. These designations are usually based on the issuing bank's established correspondent relationships. The seller should ensure that the advising/confirming bank is a financially sound institution.\n\n3. The seller should confirm the good standing of the buyer's issuing bank if the letter of credit is unconfirmed.\n\n4. For confirmed letters of credit, the seller's advising bank should be willing to confirm the letter of credit issued by the buyer's bank. If the advising bank refuses to do so, the seller should request another issuing bank as the current bank may be or is in the process of becoming insolvent.\n\n5. The seller should carefully review the letter of credit to ensure its conditions can be met. All documents must conform to the terms of the letter of credit. The seller must comply with every detail of the letter of credit specifications; otherwise the security given by the credit is lost.\n\n6. The seller should ensure that the letter of credit is irrevocable.\n\n7. If amendments are necessary, the seller should contact the buyer immediately so that the buyer can instruct the issuing bank to make the necessary changes quickly. The seller should keep the letter of credit's expiration date in mind throughout the amendment process.\n\n8. The seller should confirm with the insurance company that it can provide the coverage specified in the letter of credit and that insurance charges listed in the letter of credit are correct. Typical insurance coverage is for CIF (cost, insurance and freight) often the value of the goods plus about 10 percent.\n\n9. The seller must ensure that the goods match the description in the letter of credit and the invoice description.\n\n10. The seller should be familiar with foreign exchange limitations in the buyer's country that could hinder payment procedures.\n\nBuyer\n1. When choosing the type of letter of credit, the buyer should consider the standard payment methods in the seller's country.\n\n2. The buyer should keep the details of the purchase short and concise.\n\n3. The buyer should be prepared to amend or re-negotiate terms of the letter of credit with the seller. This is a common procedure in international trade. With irrevocable letters of credit, the most common type, all parties must agree to amend the document.\n\n4. The buyer can reduce the foreign exchange risk by buying forward currency contracts.\n\n5. The buyer should use a bank experienced in foreign trade as its issuing bank.\n\n6. The validation time stated on the letter of credit should give the seller ample time to produce the goods or to pull them out of stock.\n\n7. A letter of credit is not fail-safe. Banks are only responsible for the documents exchanged and not the goods shipped. Documents in conformity with the letter of credit specifications cannot be rejected on grounds that the goods were not delivered as specified in the contract. The goods shipped may not in fact be the goods ordered and paid for.\n\n8. Purchase contracts and other agreements pertaining to the sale between the buyer and seller are not the concern of the issuing bank. Only the letter of credit terms are binding on the bank.\n\n9. Documents specified in the letter of credit should include those the buyer requires for customs clearance.",
			"DisplayFolderInfo": "{\"name\":\"Product\",\"colorCode\":\"#0E3D73\"}",
			"PrimaryKeys": "ProductId",
			"spark.sql.sources.provider": "csv"
		},
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false
	},
	"type": "TABLE"
}