{
	"name": "MortgageLoanProduct",
	"properties": {
		"Namespace": {
			"DatabaseName": "banking"
		},
		"Name": "MortgageLoanProduct",
		"Description": "A mortgage loan is a loan to finance the purchase of real estate, usually with specified payment periods and interest rates. The borrower (mortgagor) gives the lender (mortgagee) a lien on the property as collateral for the loan. The mortgagor's lien on the property expires when the mortgage is paid off in full. \n\nA home buyer or builder can obtain financing (loan) either to purchase or secure against the property from a financial institution either directly or indirectly through intermediaries\n\nMortgages have an interest rate and are scheduled to amortize over a set period of time; typically 30 years. All types of real property can, and usually are, secured with a mortgage and bear an interest rate that is supposed to reflect the lender's risk.  Mortgage lending will also take into account the riskiness of the mortgage loan.\n\nMortgage lending is the primary mechanism used in many countries to finance private ownership of residential property and have basically similar characteristics:\n\nMortgage - the security created on the property by the lender, which will usually include certain restrictions on the use or disposal of the property.\nBorrower: the person borrowing who either has or is creating an ownership interest in the property.\n\nLender: any lender, but usually a bank or other financial institution.\n\nPrincipal - the original size of the loan, which may or may not include certain other costs; as any principal is repaid, the principal will go down in size.\n\nInterest - a financial charge for use of the lender's money.\n\nForeclosure/repossession - the possibility that the lender has to foreclose, repossess or seize the property under certain circumstances is essential to a mortgage loan.\n\nLenders provide funds against property to earn interest income, and generally borrow these funds themselves by taking deposits or issuing bonds. The price at which the lenders borrow money therefore affects the cost of borrowing. Lenders may also sell the mortgage loan to other parties who are interested in receiving the stream of cash payments from the borrower (securitization). In the United States, the largest firms securitizing loans are Fannie Mae and Freddie Mac, which are government sponsored enterprises.\n\nMortgage loans are generally structured as long-term loans, the periodic payments for which are similar to an annuity and calculated according to the time value of money formula. The most basic arrangement would require a fixed monthly payment over a period of ten to thirty years, depending on local conditions. Over this period the principal component of the loan would be slowly paid down through amortization. \n\nUpon making a mortgage loan for purchase of a property, lenders usually require that the borrower make a down payment, that is, contribute a portion of the cost of the property. This down payment may be expressed as a portion of the value of the.  The loan to value ratio (or LTV) is the size of the loan against the value of the property.  The loan to value ratio is considered an important indicator of the riskiness of a mortgage loan: the higher the LTV, the higher the risk that the value of the property will be insufficient to cover the remaining principal of the loan.\n\nSince the value of the property is an important factor in understanding the risk of the loan, determining the value is a key factor in mortgage lending. The value may be determined in various ways, but the most common are:\n\n1. Actual or transaction value: this is usually taken to be the purchase price of the property. If the property is not being purchased at the time of borrowing, this information may not be available.\n\n2. Appraised or surveyed value: in most jurisdictions, some form of appraisal of the value by a licensed professional is common. There is often a requirement for the lender to obtain an official appraisal.\n\n3 Estimated value: lenders or other parties may use their own internal estimates, particularly in jurisdictions where no official appraisal procedure exists, but also in some other circumstances.\n\nThere are many types of mortgages used worldwide, but several factors broadly define the characteristics of the mortgage. All of these may be subject to local regulation and legal requirements.\n\n- Interest: interest may be fixed for the life of the loan or variable, and change at certain pre-defined periods; the interest rate can also, of course, be higher or lower.\n\n- Term: mortgage loans generally have a maximum term, that is, the number of years after which an amortizing loan will be repaid. Some mortgage loans may have no amortization, or require full repayment of any remaining balance at a certain date, or even negative amortization.\n\n Payment amount and frequency: the amount paid per period and the frequency of payments; in some cases, the amount paid per period may change or the borrower may have the option to increase or decrease the amount paid.\n\n- Prepayment: some types of mortgages may limit or restrict prepayment of all or a portion of the loan, or require payment of a penalty to the lender for prepayment.\n\nThe two basic types of amortized loans are the fixed rate mortgage (FRM) and adjustable rate mortgage (ARM).  In many countries, floating rate mortgages are the norm and will simply be referred to as mortgages; in the United States, fixed rate mortgages are typically considered \"standard.\" Combinations of fixed and floating rate are also common, whereby a mortgage loan will have a fixed rate for some period, and vary after the end of that period.\n\nIn a fixed rate mortgage, the interest rate, and hence periodic payment, remains fixed for the life of the loan. In the U.S., the term is usually up to 30 year with 15 to 30 years being common.  For a fixed rate mortgage, payments for principal and interest should not change over the life of the loan, although ancillary costs (such as property taxes and insurance) can and do change.\n\nIn an adjustable rate mortgage, the interest rate is generally fixed for a period of time, after which it will periodically adjust up or down to some market index such as Common indices in the U.S. include the Prime Rate, the London Interbank Offered Rate (LIBOR), or the Treasury Index.\n\nA partial amortization or balloon loan is one where the amount of monthly payments due are calculated or amortized over a certain term, but the outstanding principal balance is due at some point short of that term. The interest rate for a balloon loan can be either fixed or floating. \n\nOther related loan types:\n- Assumed mortgage\n- Balloon mortgage\n- Blanket loan\n- Bridge loan\n- Budget loan\n- Buy down mortgage\n- Commercial loan\n- Endowment mortgage\n- Equity loan\n- Flexible mortgage\n- Foreign National mortgage\n- Graduated payment mortgage loan\n- Hard money loan\n- Jumbo mortgages\n- Offset mortgage\n- Package loan\n- Participation mortgage\n- Reverse mortgage\n- Repayment mortgage\n- Seasoned mortgage\n- Term loan or Interest-only loan\n- Wraparound mortgage\n- Negative amortization loan\n- Non-conforming mortgage\n\nThe concept of equity in a property refers to the value of the property minus the outstanding debt depending upon the definition of the valuation of the property \n\nIn most countries, a number of more or less standard measures of creditworthiness may be applied to the mortgage loan. Common measures include payment to income (mortgage payments as a percentage of gross or net income); debt to income (all debt payments, including mortgage payments, as a percentage of income); and various net worth measures. Credit scores may be used in lieu of or to supplement these measures. There will also be requirements for documentation of the creditworthiness, such as income tax returns, pay stubs, etic; the specifics will vary from location to location. Many countries have lower requirements for certain borrowers, or \"no-doc\" / \"low-doc\" lending standards that may be acceptable in certain circumstances.\n\nMany countries have a notion of standard or conforming mortgages that define a perceived acceptable level of risk, which may be formal or informal, and may be reinforced by laws, government intervention, or market practice. For example, a standard mortgage may be considered to be one with no more than 70-80% LTV and no more than one-third of gross income going to mortgage debt.\n\nA standard or conforming mortgage is a key concept as it often defines whether or not the mortgage can be easily sold or securitized, or, if non-standard, may affect the price at which it may be sold. In the United States, a conforming mortgage is one which meets the established rules and procedures of the two major government-sponsored entities in the housing finance market (including some legal requirements). In contrast, lenders who decide to make nonconforming loans are exercising a higher risk tolerance and do so knowing that they face more challenge in reselling the loan. Many countries have similar concepts or agencies that define what are \"standard\" mortgages. \n\nThe most common way to repay a loan is to make regular payments of the capital (principal) and interest over a set term. This is commonly referred to as (self) amortization in the U.S. and as a repayment mortgage in the UK. \nDepending on the size of the loan and the prevailing practice in the country the term may be short (10 years) or long (50 years plus). In the UK and U.S., 25 to 30 years is the usual maximum term (although shorter periods, such as 15-year mortgage loans, are common). Mortgage payments, which are typically made monthly, contain a capital (repayment of the principal) and an interest element. The amount of capital included in each payment varies throughout the term of the mortgage. In the early years the repayments are largely interest and a small part capital. Towards the end of the mortgage the payments are mostly capital and a smaller portion interest. In this way the payment amount determined at outset is calculated to ensure the loan is repaid at a specified date in the future. This gives borrowers assurance that by maintaining repayment the loan will be cleared at a specified date, if the interest rate does not change.\n\nThe main alternative to capital and interest mortgage is an interest only mortgage, where the capital is not repaid throughout the term. This type of mortgage is common in the UK, especially when associated with a regular investment plan. With this arrangement regular contributions are made to a separate investment plan designed to build up a lump sum to repay the mortgage at maturity. This type of arrangement is called an investment-backed mortgage or is often related to the type of plan used: endowment mortgage if an endowment policy is used, similarly a Personal Equity Plan (PEP) mortgage, Individual Savings Account (ISA) mortgage or pension mortgage. Historically, investment-backed mortgages offered various tax advantages over repayment mortgages, although this is no longer the case in the UK. Investment-backed mortgages are seen as higher risk as they are dependent on the investment making sufficient return to clear the debt.\n\nUntil recently it was not uncommon for interest only mortgages to be arranged without a repayment vehicle, with the borrower gambling that the property market will rise sufficiently for the loan to be repaid by trading down at retirement (or when rent on the property and inflation combine to surpass the interest rate).\n\nFor older borrowers (typically in retirement), it may be possible to arrange a mortgage where neither the capital nor interest is repaid. The interest is rolled up with the capital, increasing the debt each year.\n\nThese arrangements are variously called reverse mortgages, lifetime mortgages or equity release mortgages, depending on the country. The loans are typically not repaid until the borrowers die, hence the age restriction. \n\nIn the U.S. a partial amortization or balloon loan is one where the amount of monthly payments due are calculated (amortized) over a certain term, but the outstanding capital balance is due at some point short of that term. In the UK, a part repayment mortgage is quite common, especially where the original mortgage was investment-backed and on moving house further borrowing is arranged on a capital and interest (repayment) basis.\n\nIn most jurisdictions, a lender may foreclose the mortgaged property if certain conditions - principally, non-payment of the mortgage loan - obtain. Subject to local legal requirements, the property may then be sold. Any amounts received from the sale (net of costs) are applied to the original debt. In some jurisdictions, mortgage loans are non-recourse loans: if the funds recouped from sale of the mortgaged property are insufficient to cover the outstanding debt, the lender may not have recourse to the borrower after foreclosure. In other jurisdictions, the borrower remains responsible for any remaining debt. In virtually all jurisdictions, specific procedures for foreclosure and sale of the mortgaged property apply, and may be tightly regulated by the relevant government; in some jurisdictions, foreclosure and sale can occur quite rapidly, while in others, foreclosure may take many months or even years. In many countries, the ability of lenders to foreclose is extremely limited, and mortgage market development has been notably slower.\n\nIn the U.S., the process by which a mortgage is secured by a borrower is called origination. This involves the borrower submitting an application and documentation related to his/her financial history and/or credit history to the underwriter. Many banks now offer \"no-doc\" or \"low-doc\" loans in which the borrower is required to submit only minimal financial information. These loans carry a higher interest rate and are available only to borrowers with excellent credit. Sometimes, a third party is involved, such as a mortgage broker. This entity takes the borrower's information and reviews a number of lenders, selecting the ones that will best meet the needs of the consumer.\n\nLoans are often sold on the open market to larger investors by the originating mortgage company. Many of the guidelines that they follow are suited to satisfy investors. Some companies, called correspondent lenders, sell all or most of their closed loans to these investors, accepting some risks for issuing them. They often offer niche loans at higher prices that the investor does not wish to originate.\n\nIf the underwriter is not satisfied with the documentation provided by the borrower, additional documentation and conditions may be imposed, called stipulations. The meeting of such conditions can be a daunting experience for the consumer, but it is crucial for the lending institution to ensure the information being submitted is accurate and meets specific guidelines. This is done to give the lender a reasonable guarantee that the borrower can and will repay the loan. If a third party is involved in the loan, it will help the borrower to clear such conditions.\n\nThe following documents are typically required for traditional underwriter review. Over the past several years, use of \"automated underwriting\" statistical models has reduced the amount of documentation required from many borrowers. Such automated underwriting engines include Freddie Mac's \"Loan Prospector\" and Fannie Mae's \"Desktop Underwriter\". For borrowers who have excellent credit and very acceptable debt positions, there may be virtually no documentation of income or assets required at all.\nMany of these documents are also not required for no-doc and low-doc loans.\n\n- Credit Report\n- 1003 - Uniform Residential Loan Application\n- 1004 - Uniform Residential Appraisal Report\n- 1005 - Verification Of Employment (VOE)\n- 1006 - Verification Of Deposit (VOD)\n- 1007 - Single Family Comparable Rent Schedule\n- 1008 - Transmittal Summary\n- Copy of deed of current home\n- Federal income tax records for last two years\n- Verification of Mortgage (VOM) or Verification of Payment (VOP)\n- Borrower's Authorization\n- Purchase Sales Agreement\n- 1084A and 1084B (Self-Employed Income Analysis) and 1088 \n\nAn option ARM provides the option to pay as little as the equivalent of an amortized payment based on a 1% interest rate.  As a result, the difference between the monthly payment and the interest on the loan is added to the loan principal; the loan at this point has negative amortization. In this respect, an option ARM provides a form of equity withdrawal (as in a cash-out refinancing) but over a period of time.\n\nThe option ARM gives a number of payment choices each month (for example, the equivalent of an amortized payment where the interest rate 1%, interest only based on actual interest rate, actual 30 year amortized payment, actual 15 year amortized payment). The interest rate may adjust every month in accordance with the index to which the loan is tied and the terms of the specific loan. These loans may be useful for people who have a lot of equity in their home and want to lower monthly costs; for investors, allowing them the flexibility to choose which payment to make every month; or for those with irregular incomes (such as those working on commission or for whom bonuses comprise a large portion of income).\n\nOne of the important features of this type of loan is that the minimum payments are often fixed for each year for an initial term of up to 5 years. The minimum payment may rise each year a little (payment size increases of 7.5% are common) but remain the same for another year. The interest rate may fluctuate each month, which means that the extent of any negative amortization cannot be predicted beyond worst-case scenario as dictated by the terms of the loan.\n\nLenders may charge various fees when giving a mortgage to a mortgagor. These include entry fees, exit fees, administration fees and lenders mortgage insurance. There are also settlement fees (closing costs) the settlement company will charge. In addition, if a third party handles the loan, it may charge other fees as well.\n\nThe Sharia law of Islam prohibits the payment or receipt of interest, which means that practicing Muslims cannot use conventional mortgages. However, real estate is far too expensive for most people to buy outright using cash: Islamic mortgages solve this problem by having the property change hands twice. In one variation, the bank will buy the house outright and then act as a landlord. The homebuyer, in addition to paying rent, will pay a contribution towards the purchase of the property. When the last payment is made, the property changes hands.\n\nTypically, this may lead to a higher final price for the buyers. This is because in some countries such as the United Kingdom and India there is a Stamp Duty which is a tax charged by the government on a change of ownership. Because ownership changes twice in an Islamic mortgage, a stamp tax may be charged twice. Many other jurisdictions have similar transaction taxes on change of ownership which may be levied. In the United Kingdom, the dual application of Stamp Duty in such transactions was removed in the Finance Act 2003 in order to facilitate Islamic mortgages.\n\nAn alternative scheme involves the bank reselling the property according to an installment plan, at a price higher than the original price.\nAll of these methods are still compensating the lender as if they were charging interest, but the loans are structured in a way that in name they are not, but they share the financial risks involved in the transaction with the homebuyer.",
		"EntityType": "TABLE",
		"TableType": "EXTERNAL",
		"Origin": {
			"Type": "SPARK"
		},
		"StorageDescriptor": {
			"Columns": [
				{
					"Name": "ProductId",
					"Description": "The unique identifier of a Product.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "ProductId"
					},
					"OriginDataTypeName": {
						"TypeName": "long",
						"IsComplexType": false,
						"IsNullable": false,
						"Properties": {
							"HIVE_TYPE_STRING": "long"
						}
					}
				},
				{
					"Name": "AssumptionClause",
					"Description": "A provision in an assumable mortgage that allows a buyer to assume responsibility for the mortgage from the seller. The loan does not need to be paid in full by the original borrower upon sale or transfer of the property.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "AssumptionClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "AccelerationClause",
					"Description": "The clause in a mortgage or trust deed that stipulates the entire debt is due immediately if the mortgagee defaults under the terms of the contract. \n\nCondition in a mortgage that may require the balance of the loan to become due immediately, if regular mortgage payments are not made or for breach of other conditions of the mortgage.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "AccelerationClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "ConvertibleClause",
					"Description": "A provision in some adjustable-rate mortgages (ARMs) that allows the borrower to change the ARM to a fixed-rate mortgage at specified time.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "ConvertibleClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "InterestRateCapClause",
					"Description": "A provision of an adjustable rate mortgage limiting how much interest rates may increase per adjustment period.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "InterestRateCapClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "EscalatorClause",
					"Description": "A clause in a loan providing for increases in payments or interest based on pre-determined schedules or on a specific economic index, such as the consumer price index.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "EscalatorClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "CovenantClause",
					"Description": "A clause in a mortgage that obligates or restricts the borrower and that, if violated, can result in foreclosure.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "CovenantClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "PrepaymentClause",
					"Description": "The right given to a purchaser to pay all or part of a debt prior to its maturity. The mortgagee does not have to accept any payment other than those originally agreed to.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "PrepaymentClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "DueOnSaleProvisionClause",
					"Description": "A provision in a mortgage that allows the lender to demand repayment in full if the borrower sells the property that serves as security for the mortgage.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "DueOnSaleProvisionClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "DueOnTransferProvisionClause",
					"Description": "This terminology is usually used for second mortgages.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "DueOnTransferProvisionClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "CoinsuranceClause",
					"Description": "A provision in a hazard insurance policy that states the amount of coverage that must be maintained -- as a percentage of the total value of the property -- for the insured to collect the full amount of a loss.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "CoinsuranceClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "LockInClause",
					"Description": "Clause in a loan agreement that states that the borrower cannot repay a loan prior to a specified date.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "LockInClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "CallOptionClause",
					"Description": "A provision in the mortgage that gives the mortgagee the right to call the mortgage due and payable at the end of a specified period for whatever reason.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "CallOptionClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "ReconveyanceClause",
					"Description": "The clause in a trust deed that gives the title back to the borrower when the loan is paid in full.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "ReconveyanceClause"
					},
					"OriginDataTypeName": {
						"TypeName": "string",
						"IsComplexType": false,
						"IsNullable": true,
						"Length": 2048,
						"Properties": {
							"HIVE_TYPE_STRING": "string"
						}
					}
				},
				{
					"Name": "MortgageLoanTypeId",
					"Description": "The unique identifier of a Mortgage Loan Type.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "MortgageLoanTypeId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				},
				{
					"Name": "LoanConversionOptionId",
					"Description": "The unique identifier of a Loan Conversion Option.",
					"BaseAttributeReference": {
						"Entity": "MortgageLoanProduct.cdm.json/MortgageLoanProduct",
						"Name": "LoanConversionOptionId"
					},
					"OriginDataTypeName": {
						"TypeName": "integer",
						"IsComplexType": false,
						"IsNullable": true,
						"Properties": {
							"HIVE_TYPE_STRING": "integer"
						}
					}
				}
			],
			"Format": {
				"InputFormat": "org.apache.hadoop.mapred.SequenceFileInputFormat",
				"OutputFormat": "org.apache.hadoop.hive.ql.io.HiveSequenceFileOutputFormat",
				"FormatType": "csv",
				"SerializeLib": "org.apache.hadoop.hive.serde2.lazy.LazySimpleSerDe",
				"Properties": {
					"path": "abfss://dpu@adlsgen2deepu.dfs.core.windows.net/dpu_json_test/MortgageLoanProduct",
					"delimiter": ",",
					"multiLine": "false",
					"firstRowAsHeader": "false",
					"serialization.format": "1",
					"escape": "\\",
					"quote": "\"",
					"FormatTypeSetToDatabaseDefault": true,
					"header": "false"
				}
			},
			"Source": {
				"Provider": "ADLS",
				"Location": "abfss://dpu@adlsgen2deepu.dfs.core.windows.net/dpu_json_test/MortgageLoanProduct",
				"Properties": {
					"LinkedServiceName": "wspc-dpu-WorkspaceDefaultStorage",
					"LocationSetToDatabaseDefault": true
				}
			},
			"Properties": {
				"textinputformat.record.delimiter": ",",
				"compression": "{\"type\":\"None\",\"level\":\"optimal\"}",
				"derivedModelAttributeInfo": "{\"attributeReferences\":{\"ProductId\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"ProductId\"},\"AssumptionClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"AssumptionClause\"},\"AccelerationClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"AccelerationClause\"},\"ConvertibleClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"ConvertibleClause\"},\"InterestRateCapClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"InterestRateCapClause\"},\"EscalatorClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"EscalatorClause\"},\"CovenantClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"CovenantClause\"},\"PrepaymentClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"PrepaymentClause\"},\"DueOnSaleProvisionClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"DueOnSaleProvisionClause\"},\"DueOnTransferProvisionClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"DueOnTransferProvisionClause\"},\"CoinsuranceClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"CoinsuranceClause\"},\"LockInClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"LockInClause\"},\"CallOptionClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"CallOptionClause\"},\"ReconveyanceClause\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"ReconveyanceClause\"},\"MortgageLoanTypeId\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"MortgageLoanTypeId\"},\"LoanConversionOptionId\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"LoanConversionOptionId\"}}}"
			},
			"Compressed": false,
			"IsStoredAsSubdirectories": false
		},
		"Properties": {
			"DerivedModelEntityInfo": "{\"entityDirectives\":{\"baseEntityReference\":{\"name\":\"MortgageLoanProduct\",\"path\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\"},\"description\":\"A mortgage loan is a loan to finance the purchase of real estate, usually with specified payment periods and interest rates. The borrower (mortgagor) gives the lender (mortgagee) a lien on the property as collateral for the loan. The mortgagor's lien on the property expires when the mortgage is paid off in full. \\n\\nA home buyer or builder can obtain financing (loan) either to purchase or secure against the property from a financial institution either directly or indirectly through intermediaries\\n\\nMortgages have an interest rate and are scheduled to amortize over a set period of time; typically 30 years. All types of real property can, and usually are, secured with a mortgage and bear an interest rate that is supposed to reflect the lender's risk.  Mortgage lending will also take into account the riskiness of the mortgage loan.\\n\\nMortgage lending is the primary mechanism used in many countries to finance private ownership of residential property and have basically similar characteristics:\\n\\nMortgage - the security created on the property by the lender, which will usually include certain restrictions on the use or disposal of the property.\\nBorrower: the person borrowing who either has or is creating an ownership interest in the property.\\n\\nLender: any lender, but usually a bank or other financial institution.\\n\\nPrincipal - the original size of the loan, which may or may not include certain other costs; as any principal is repaid, the principal will go down in size.\\n\\nInterest - a financial charge for use of the lender's money.\\n\\nForeclosure/repossession - the possibility that the lender has to foreclose, repossess or seize the property under certain circumstances is essential to a mortgage loan.\\n\\nLenders provide funds against property to earn interest income, and generally borrow these funds themselves by taking deposits or issuing bonds. The price at which the lenders borrow money therefore affects the cost of borrowing. Lenders may also sell the mortgage loan to other parties who are interested in receiving the stream of cash payments from the borrower (securitization). In the United States, the largest firms securitizing loans are Fannie Mae and Freddie Mac, which are government sponsored enterprises.\\n\\nMortgage loans are generally structured as long-term loans, the periodic payments for which are similar to an annuity and calculated according to the time value of money formula. The most basic arrangement would require a fixed monthly payment over a period of ten to thirty years, depending on local conditions. Over this period the principal component of the loan would be slowly paid down through amortization. \\n\\nUpon making a mortgage loan for purchase of a property, lenders usually require that the borrower make a down payment, that is, contribute a portion of the cost of the property. This down payment may be expressed as a portion of the value of the.  The loan to value ratio (or LTV) is the size of the loan against the value of the property.  The loan to value ratio is considered an important indicator of the riskiness of a mortgage loan: the higher the LTV, the higher the risk that the value of the property will be insufficient to cover the remaining principal of the loan.\\n\\nSince the value of the property is an important factor in understanding the risk of the loan, determining the value is a key factor in mortgage lending. The value may be determined in various ways, but the most common are:\\n\\n1. Actual or transaction value: this is usually taken to be the purchase price of the property. If the property is not being purchased at the time of borrowing, this information may not be available.\\n\\n2. Appraised or surveyed value: in most jurisdictions, some form of appraisal of the value by a licensed professional is common. There is often a requirement for the lender to obtain an official appraisal.\\n\\n3 Estimated value: lenders or other parties may use their own internal estimates, particularly in jurisdictions where no official appraisal procedure exists, but also in some other circumstances.\\n\\nThere are many types of mortgages used worldwide, but several factors broadly define the characteristics of the mortgage. All of these may be subject to local regulation and legal requirements.\\n\\n- Interest: interest may be fixed for the life of the loan or variable, and change at certain pre-defined periods; the interest rate can also, of course, be higher or lower.\\n\\n- Term: mortgage loans generally have a maximum term, that is, the number of years after which an amortizing loan will be repaid. Some mortgage loans may have no amortization, or require full repayment of any remaining balance at a certain date, or even negative amortization.\\n\\n Payment amount and frequency: the amount paid per period and the frequency of payments; in some cases, the amount paid per period may change or the borrower may have the option to increase or decrease the amount paid.\\n\\n- Prepayment: some types of mortgages may limit or restrict prepayment of all or a portion of the loan, or require payment of a penalty to the lender for prepayment.\\n\\nThe two basic types of amortized loans are the fixed rate mortgage (FRM) and adjustable rate mortgage (ARM).  In many countries, floating rate mortgages are the norm and will simply be referred to as mortgages; in the United States, fixed rate mortgages are typically considered \\\"standard.\\\" Combinations of fixed and floating rate are also common, whereby a mortgage loan will have a fixed rate for some period, and vary after the end of that period.\\n\\nIn a fixed rate mortgage, the interest rate, and hence periodic payment, remains fixed for the life of the loan. In the U.S., the term is usually up to 30 year with 15 to 30 years being common.  For a fixed rate mortgage, payments for principal and interest should not change over the life of the loan, although ancillary costs (such as property taxes and insurance) can and do change.\\n\\nIn an adjustable rate mortgage, the interest rate is generally fixed for a period of time, after which it will periodically adjust up or down to some market index such as Common indices in the U.S. include the Prime Rate, the London Interbank Offered Rate (LIBOR), or the Treasury Index.\\n\\nA partial amortization or balloon loan is one where the amount of monthly payments due are calculated or amortized over a certain term, but the outstanding principal balance is due at some point short of that term. The interest rate for a balloon loan can be either fixed or floating. \\n\\nOther related loan types:\\n- Assumed mortgage\\n- Balloon mortgage\\n- Blanket loan\\n- Bridge loan\\n- Budget loan\\n- Buy down mortgage\\n- Commercial loan\\n- Endowment mortgage\\n- Equity loan\\n- Flexible mortgage\\n- Foreign National mortgage\\n- Graduated payment mortgage loan\\n- Hard money loan\\n- Jumbo mortgages\\n- Offset mortgage\\n- Package loan\\n- Participation mortgage\\n- Reverse mortgage\\n- Repayment mortgage\\n- Seasoned mortgage\\n- Term loan or Interest-only loan\\n- Wraparound mortgage\\n- Negative amortization loan\\n- Non-conforming mortgage\\n\\nThe concept of equity in a property refers to the value of the property minus the outstanding debt depending upon the definition of the valuation of the property \\n\\nIn most countries, a number of more or less standard measures of creditworthiness may be applied to the mortgage loan. Common measures include payment to income (mortgage payments as a percentage of gross or net income); debt to income (all debt payments, including mortgage payments, as a percentage of income); and various net worth measures. Credit scores may be used in lieu of or to supplement these measures. There will also be requirements for documentation of the creditworthiness, such as income tax returns, pay stubs, etic; the specifics will vary from location to location. Many countries have lower requirements for certain borrowers, or \\\"no-doc\\\" / \\\"low-doc\\\" lending standards that may be acceptable in certain circumstances.\\n\\nMany countries have a notion of standard or conforming mortgages that define a perceived acceptable level of risk, which may be formal or informal, and may be reinforced by laws, government intervention, or market practice. For example, a standard mortgage may be considered to be one with no more than 70-80% LTV and no more than one-third of gross income going to mortgage debt.\\n\\nA standard or conforming mortgage is a key concept as it often defines whether or not the mortgage can be easily sold or securitized, or, if non-standard, may affect the price at which it may be sold. In the United States, a conforming mortgage is one which meets the established rules and procedures of the two major government-sponsored entities in the housing finance market (including some legal requirements). In contrast, lenders who decide to make nonconforming loans are exercising a higher risk tolerance and do so knowing that they face more challenge in reselling the loan. Many countries have similar concepts or agencies that define what are \\\"standard\\\" mortgages. \\n\\nThe most common way to repay a loan is to make regular payments of the capital (principal) and interest over a set term. This is commonly referred to as (self) amortization in the U.S. and as a repayment mortgage in the UK. \\nDepending on the size of the loan and the prevailing practice in the country the term may be short (10 years) or long (50 years plus). In the UK and U.S., 25 to 30 years is the usual maximum term (although shorter periods, such as 15-year mortgage loans, are common). Mortgage payments, which are typically made monthly, contain a capital (repayment of the principal) and an interest element. The amount of capital included in each payment varies throughout the term of the mortgage. In the early years the repayments are largely interest and a small part capital. Towards the end of the mortgage the payments are mostly capital and a smaller portion interest. In this way the payment amount determined at outset is calculated to ensure the loan is repaid at a specified date in the future. This gives borrowers assurance that by maintaining repayment the loan will be cleared at a specified date, if the interest rate does not change.\\n\\nThe main alternative to capital and interest mortgage is an interest only mortgage, where the capital is not repaid throughout the term. This type of mortgage is common in the UK, especially when associated with a regular investment plan. With this arrangement regular contributions are made to a separate investment plan designed to build up a lump sum to repay the mortgage at maturity. This type of arrangement is called an investment-backed mortgage or is often related to the type of plan used: endowment mortgage if an endowment policy is used, similarly a Personal Equity Plan (PEP) mortgage, Individual Savings Account (ISA) mortgage or pension mortgage. Historically, investment-backed mortgages offered various tax advantages over repayment mortgages, although this is no longer the case in the UK. Investment-backed mortgages are seen as higher risk as they are dependent on the investment making sufficient return to clear the debt.\\n\\nUntil recently it was not uncommon for interest only mortgages to be arranged without a repayment vehicle, with the borrower gambling that the property market will rise sufficiently for the loan to be repaid by trading down at retirement (or when rent on the property and inflation combine to surpass the interest rate).\\n\\nFor older borrowers (typically in retirement), it may be possible to arrange a mortgage where neither the capital nor interest is repaid. The interest is rolled up with the capital, increasing the debt each year.\\n\\nThese arrangements are variously called reverse mortgages, lifetime mortgages or equity release mortgages, depending on the country. The loans are typically not repaid until the borrowers die, hence the age restriction. \\n\\nIn the U.S. a partial amortization or balloon loan is one where the amount of monthly payments due are calculated (amortized) over a certain term, but the outstanding capital balance is due at some point short of that term. In the UK, a part repayment mortgage is quite common, especially where the original mortgage was investment-backed and on moving house further borrowing is arranged on a capital and interest (repayment) basis.\\n\\nIn most jurisdictions, a lender may foreclose the mortgaged property if certain conditions - principally, non-payment of the mortgage loan - obtain. Subject to local legal requirements, the property may then be sold. Any amounts received from the sale (net of costs) are applied to the original debt. In some jurisdictions, mortgage loans are non-recourse loans: if the funds recouped from sale of the mortgaged property are insufficient to cover the outstanding debt, the lender may not have recourse to the borrower after foreclosure. In other jurisdictions, the borrower remains responsible for any remaining debt. In virtually all jurisdictions, specific procedures for foreclosure and sale of the mortgaged property apply, and may be tightly regulated by the relevant government; in some jurisdictions, foreclosure and sale can occur quite rapidly, while in others, foreclosure may take many months or even years. In many countries, the ability of lenders to foreclose is extremely limited, and mortgage market development has been notably slower.\\n\\nIn the U.S., the process by which a mortgage is secured by a borrower is called origination. This involves the borrower submitting an application and documentation related to his/her financial history and/or credit history to the underwriter. Many banks now offer \\\"no-doc\\\" or \\\"low-doc\\\" loans in which the borrower is required to submit only minimal financial information. These loans carry a higher interest rate and are available only to borrowers with excellent credit. Sometimes, a third party is involved, such as a mortgage broker. This entity takes the borrower's information and reviews a number of lenders, selecting the ones that will best meet the needs of the consumer.\\n\\nLoans are often sold on the open market to larger investors by the originating mortgage company. Many of the guidelines that they follow are suited to satisfy investors. Some companies, called correspondent lenders, sell all or most of their closed loans to these investors, accepting some risks for issuing them. They often offer niche loans at higher prices that the investor does not wish to originate.\\n\\nIf the underwriter is not satisfied with the documentation provided by the borrower, additional documentation and conditions may be imposed, called stipulations. The meeting of such conditions can be a daunting experience for the consumer, but it is crucial for the lending institution to ensure the information being submitted is accurate and meets specific guidelines. This is done to give the lender a reasonable guarantee that the borrower can and will repay the loan. If a third party is involved in the loan, it will help the borrower to clear such conditions.\\n\\nThe following documents are typically required for traditional underwriter review. Over the past several years, use of \\\"automated underwriting\\\" statistical models has reduced the amount of documentation required from many borrowers. Such automated underwriting engines include Freddie Mac's \\\"Loan Prospector\\\" and Fannie Mae's \\\"Desktop Underwriter\\\". For borrowers who have excellent credit and very acceptable debt positions, there may be virtually no documentation of income or assets required at all.\\nMany of these documents are also not required for no-doc and low-doc loans.\\n\\n- Credit Report\\n- 1003 - Uniform Residential Loan Application\\n- 1004 - Uniform Residential Appraisal Report\\n- 1005 - Verification Of Employment (VOE)\\n- 1006 - Verification Of Deposit (VOD)\\n- 1007 - Single Family Comparable Rent Schedule\\n- 1008 - Transmittal Summary\\n- Copy of deed of current home\\n- Federal income tax records for last two years\\n- Verification of Mortgage (VOM) or Verification of Payment (VOP)\\n- Borrower's Authorization\\n- Purchase Sales Agreement\\n- 1084A and 1084B (Self-Employed Income Analysis) and 1088 \\n\\nAn option ARM provides the option to pay as little as the equivalent of an amortized payment based on a 1% interest rate.  As a result, the difference between the monthly payment and the interest on the loan is added to the loan principal; the loan at this point has negative amortization. In this respect, an option ARM provides a form of equity withdrawal (as in a cash-out refinancing) but over a period of time.\\n\\nThe option ARM gives a number of payment choices each month (for example, the equivalent of an amortized payment where the interest rate 1%, interest only based on actual interest rate, actual 30 year amortized payment, actual 15 year amortized payment). The interest rate may adjust every month in accordance with the index to which the loan is tied and the terms of the specific loan. These loans may be useful for people who have a lot of equity in their home and want to lower monthly costs; for investors, allowing them the flexibility to choose which payment to make every month; or for those with irregular incomes (such as those working on commission or for whom bonuses comprise a large portion of income).\\n\\nOne of the important features of this type of loan is that the minimum payments are often fixed for each year for an initial term of up to 5 years. The minimum payment may rise each year a little (payment size increases of 7.5% are common) but remain the same for another year. The interest rate may fluctuate each month, which means that the extent of any negative amortization cannot be predicted beyond worst-case scenario as dictated by the terms of the loan.\\n\\nLenders may charge various fees when giving a mortgage to a mortgagor. These include entry fees, exit fees, administration fees and lenders mortgage insurance. There are also settlement fees (closing costs) the settlement company will charge. In addition, if a third party handles the loan, it may charge other fees as well.\\n\\nThe Sharia law of Islam prohibits the payment or receipt of interest, which means that practicing Muslims cannot use conventional mortgages. However, real estate is far too expensive for most people to buy outright using cash: Islamic mortgages solve this problem by having the property change hands twice. In one variation, the bank will buy the house outright and then act as a landlord. The homebuyer, in addition to paying rent, will pay a contribution towards the purchase of the property. When the last payment is made, the property changes hands.\\n\\nTypically, this may lead to a higher final price for the buyers. This is because in some countries such as the United Kingdom and India there is a Stamp Duty which is a tax charged by the government on a change of ownership. Because ownership changes twice in an Islamic mortgage, a stamp tax may be charged twice. Many other jurisdictions have similar transaction taxes on change of ownership which may be levied. In the United Kingdom, the dual application of Stamp Duty in such transactions was removed in the Finance Act 2003 in order to facilitate Islamic mortgages.\\n\\nAn alternative scheme involves the bank reselling the property according to an installment plan, at a price higher than the original price.\\nAll of these methods are still compensating the lender as if they were charging interest, but the loans are structured in a way that in name they are not, but they share the financial risks involved in the transaction with the homebuyer.\",\"primaryKey\":[\"ProductId\"],\"projectionInfo\":{\"attributes\":[{\"type\":\"Existing\",\"name\":\"ProductId\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"ProductId\"},\"dataType\":\"long\"},{\"type\":\"Existing\",\"name\":\"AssumptionClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"AssumptionClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"AccelerationClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"AccelerationClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"ConvertibleClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"ConvertibleClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"InterestRateCapClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"InterestRateCapClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"EscalatorClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"EscalatorClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"CovenantClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"CovenantClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"PrepaymentClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"PrepaymentClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"DueOnSaleProvisionClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"DueOnSaleProvisionClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"DueOnTransferProvisionClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"DueOnTransferProvisionClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"CoinsuranceClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"CoinsuranceClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"LockInClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"LockInClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"CallOptionClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"CallOptionClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"ReconveyanceClause\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"ReconveyanceClause\"},\"dataType\":\"string\",\"dataTypeLength\":2048},{\"type\":\"Existing\",\"name\":\"MortgageLoanTypeId\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"MortgageLoanTypeId\"},\"dataType\":\"integer\"},{\"type\":\"Existing\",\"name\":\"LoanConversionOptionId\",\"attributeReference\":{\"entity\":\"MortgageLoanProduct.cdm.json/MortgageLoanProduct\",\"name\":\"LoanConversionOptionId\"},\"dataType\":\"integer\"}]}}}",
			"Description": "A mortgage loan is a loan to finance the purchase of real estate, usually with specified payment periods and interest rates. The borrower (mortgagor) gives the lender (mortgagee) a lien on the property as collateral for the loan. The mortgagor's lien on the property expires when the mortgage is paid off in full. \n\nA home buyer or builder can obtain financing (loan) either to purchase or secure against the property from a financial institution either directly or indirectly through intermediaries\n\nMortgages have an interest rate and are scheduled to amortize over a set period of time; typically 30 years. All types of real property can, and usually are, secured with a mortgage and bear an interest rate that is supposed to reflect the lender's risk.  Mortgage lending will also take into account the riskiness of the mortgage loan.\n\nMortgage lending is the primary mechanism used in many countries to finance private ownership of residential property and have basically similar characteristics:\n\nMortgage - the security created on the property by the lender, which will usually include certain restrictions on the use or disposal of the property.\nBorrower: the person borrowing who either has or is creating an ownership interest in the property.\n\nLender: any lender, but usually a bank or other financial institution.\n\nPrincipal - the original size of the loan, which may or may not include certain other costs; as any principal is repaid, the principal will go down in size.\n\nInterest - a financial charge for use of the lender's money.\n\nForeclosure/repossession - the possibility that the lender has to foreclose, repossess or seize the property under certain circumstances is essential to a mortgage loan.\n\nLenders provide funds against property to earn interest income, and generally borrow these funds themselves by taking deposits or issuing bonds. The price at which the lenders borrow money therefore affects the cost of borrowing. Lenders may also sell the mortgage loan to other parties who are interested in receiving the stream of cash payments from the borrower (securitization). In the United States, the largest firms securitizing loans are Fannie Mae and Freddie Mac, which are government sponsored enterprises.\n\nMortgage loans are generally structured as long-term loans, the periodic payments for which are similar to an annuity and calculated according to the time value of money formula. The most basic arrangement would require a fixed monthly payment over a period of ten to thirty years, depending on local conditions. Over this period the principal component of the loan would be slowly paid down through amortization. \n\nUpon making a mortgage loan for purchase of a property, lenders usually require that the borrower make a down payment, that is, contribute a portion of the cost of the property. This down payment may be expressed as a portion of the value of the.  The loan to value ratio (or LTV) is the size of the loan against the value of the property.  The loan to value ratio is considered an important indicator of the riskiness of a mortgage loan: the higher the LTV, the higher the risk that the value of the property will be insufficient to cover the remaining principal of the loan.\n\nSince the value of the property is an important factor in understanding the risk of the loan, determining the value is a key factor in mortgage lending. The value may be determined in various ways, but the most common are:\n\n1. Actual or transaction value: this is usually taken to be the purchase price of the property. If the property is not being purchased at the time of borrowing, this information may not be available.\n\n2. Appraised or surveyed value: in most jurisdictions, some form of appraisal of the value by a licensed professional is common. There is often a requirement for the lender to obtain an official appraisal.\n\n3 Estimated value: lenders or other parties may use their own internal estimates, particularly in jurisdictions where no official appraisal procedure exists, but also in some other circumstances.\n\nThere are many types of mortgages used worldwide, but several factors broadly define the characteristics of the mortgage. All of these may be subject to local regulation and legal requirements.\n\n- Interest: interest may be fixed for the life of the loan or variable, and change at certain pre-defined periods; the interest rate can also, of course, be higher or lower.\n\n- Term: mortgage loans generally have a maximum term, that is, the number of years after which an amortizing loan will be repaid. Some mortgage loans may have no amortization, or require full repayment of any remaining balance at a certain date, or even negative amortization.\n\n Payment amount and frequency: the amount paid per period and the frequency of payments; in some cases, the amount paid per period may change or the borrower may have the option to increase or decrease the amount paid.\n\n- Prepayment: some types of mortgages may limit or restrict prepayment of all or a portion of the loan, or require payment of a penalty to the lender for prepayment.\n\nThe two basic types of amortized loans are the fixed rate mortgage (FRM) and adjustable rate mortgage (ARM).  In many countries, floating rate mortgages are the norm and will simply be referred to as mortgages; in the United States, fixed rate mortgages are typically considered \"standard.\" Combinations of fixed and floating rate are also common, whereby a mortgage loan will have a fixed rate for some period, and vary after the end of that period.\n\nIn a fixed rate mortgage, the interest rate, and hence periodic payment, remains fixed for the life of the loan. In the U.S., the term is usually up to 30 year with 15 to 30 years being common.  For a fixed rate mortgage, payments for principal and interest should not change over the life of the loan, although ancillary costs (such as property taxes and insurance) can and do change.\n\nIn an adjustable rate mortgage, the interest rate is generally fixed for a period of time, after which it will periodically adjust up or down to some market index such as Common indices in the U.S. include the Prime Rate, the London Interbank Offered Rate (LIBOR), or the Treasury Index.\n\nA partial amortization or balloon loan is one where the amount of monthly payments due are calculated or amortized over a certain term, but the outstanding principal balance is due at some point short of that term. The interest rate for a balloon loan can be either fixed or floating. \n\nOther related loan types:\n- Assumed mortgage\n- Balloon mortgage\n- Blanket loan\n- Bridge loan\n- Budget loan\n- Buy down mortgage\n- Commercial loan\n- Endowment mortgage\n- Equity loan\n- Flexible mortgage\n- Foreign National mortgage\n- Graduated payment mortgage loan\n- Hard money loan\n- Jumbo mortgages\n- Offset mortgage\n- Package loan\n- Participation mortgage\n- Reverse mortgage\n- Repayment mortgage\n- Seasoned mortgage\n- Term loan or Interest-only loan\n- Wraparound mortgage\n- Negative amortization loan\n- Non-conforming mortgage\n\nThe concept of equity in a property refers to the value of the property minus the outstanding debt depending upon the definition of the valuation of the property \n\nIn most countries, a number of more or less standard measures of creditworthiness may be applied to the mortgage loan. Common measures include payment to income (mortgage payments as a percentage of gross or net income); debt to income (all debt payments, including mortgage payments, as a percentage of income); and various net worth measures. Credit scores may be used in lieu of or to supplement these measures. There will also be requirements for documentation of the creditworthiness, such as income tax returns, pay stubs, etic; the specifics will vary from location to location. Many countries have lower requirements for certain borrowers, or \"no-doc\" / \"low-doc\" lending standards that may be acceptable in certain circumstances.\n\nMany countries have a notion of standard or conforming mortgages that define a perceived acceptable level of risk, which may be formal or informal, and may be reinforced by laws, government intervention, or market practice. For example, a standard mortgage may be considered to be one with no more than 70-80% LTV and no more than one-third of gross income going to mortgage debt.\n\nA standard or conforming mortgage is a key concept as it often defines whether or not the mortgage can be easily sold or securitized, or, if non-standard, may affect the price at which it may be sold. In the United States, a conforming mortgage is one which meets the established rules and procedures of the two major government-sponsored entities in the housing finance market (including some legal requirements). In contrast, lenders who decide to make nonconforming loans are exercising a higher risk tolerance and do so knowing that they face more challenge in reselling the loan. Many countries have similar concepts or agencies that define what are \"standard\" mortgages. \n\nThe most common way to repay a loan is to make regular payments of the capital (principal) and interest over a set term. This is commonly referred to as (self) amortization in the U.S. and as a repayment mortgage in the UK. \nDepending on the size of the loan and the prevailing practice in the country the term may be short (10 years) or long (50 years plus). In the UK and U.S., 25 to 30 years is the usual maximum term (although shorter periods, such as 15-year mortgage loans, are common). Mortgage payments, which are typically made monthly, contain a capital (repayment of the principal) and an interest element. The amount of capital included in each payment varies throughout the term of the mortgage. In the early years the repayments are largely interest and a small part capital. Towards the end of the mortgage the payments are mostly capital and a smaller portion interest. In this way the payment amount determined at outset is calculated to ensure the loan is repaid at a specified date in the future. This gives borrowers assurance that by maintaining repayment the loan will be cleared at a specified date, if the interest rate does not change.\n\nThe main alternative to capital and interest mortgage is an interest only mortgage, where the capital is not repaid throughout the term. This type of mortgage is common in the UK, especially when associated with a regular investment plan. With this arrangement regular contributions are made to a separate investment plan designed to build up a lump sum to repay the mortgage at maturity. This type of arrangement is called an investment-backed mortgage or is often related to the type of plan used: endowment mortgage if an endowment policy is used, similarly a Personal Equity Plan (PEP) mortgage, Individual Savings Account (ISA) mortgage or pension mortgage. Historically, investment-backed mortgages offered various tax advantages over repayment mortgages, although this is no longer the case in the UK. Investment-backed mortgages are seen as higher risk as they are dependent on the investment making sufficient return to clear the debt.\n\nUntil recently it was not uncommon for interest only mortgages to be arranged without a repayment vehicle, with the borrower gambling that the property market will rise sufficiently for the loan to be repaid by trading down at retirement (or when rent on the property and inflation combine to surpass the interest rate).\n\nFor older borrowers (typically in retirement), it may be possible to arrange a mortgage where neither the capital nor interest is repaid. The interest is rolled up with the capital, increasing the debt each year.\n\nThese arrangements are variously called reverse mortgages, lifetime mortgages or equity release mortgages, depending on the country. The loans are typically not repaid until the borrowers die, hence the age restriction. \n\nIn the U.S. a partial amortization or balloon loan is one where the amount of monthly payments due are calculated (amortized) over a certain term, but the outstanding capital balance is due at some point short of that term. In the UK, a part repayment mortgage is quite common, especially where the original mortgage was investment-backed and on moving house further borrowing is arranged on a capital and interest (repayment) basis.\n\nIn most jurisdictions, a lender may foreclose the mortgaged property if certain conditions - principally, non-payment of the mortgage loan - obtain. Subject to local legal requirements, the property may then be sold. Any amounts received from the sale (net of costs) are applied to the original debt. In some jurisdictions, mortgage loans are non-recourse loans: if the funds recouped from sale of the mortgaged property are insufficient to cover the outstanding debt, the lender may not have recourse to the borrower after foreclosure. In other jurisdictions, the borrower remains responsible for any remaining debt. In virtually all jurisdictions, specific procedures for foreclosure and sale of the mortgaged property apply, and may be tightly regulated by the relevant government; in some jurisdictions, foreclosure and sale can occur quite rapidly, while in others, foreclosure may take many months or even years. In many countries, the ability of lenders to foreclose is extremely limited, and mortgage market development has been notably slower.\n\nIn the U.S., the process by which a mortgage is secured by a borrower is called origination. This involves the borrower submitting an application and documentation related to his/her financial history and/or credit history to the underwriter. Many banks now offer \"no-doc\" or \"low-doc\" loans in which the borrower is required to submit only minimal financial information. These loans carry a higher interest rate and are available only to borrowers with excellent credit. Sometimes, a third party is involved, such as a mortgage broker. This entity takes the borrower's information and reviews a number of lenders, selecting the ones that will best meet the needs of the consumer.\n\nLoans are often sold on the open market to larger investors by the originating mortgage company. Many of the guidelines that they follow are suited to satisfy investors. Some companies, called correspondent lenders, sell all or most of their closed loans to these investors, accepting some risks for issuing them. They often offer niche loans at higher prices that the investor does not wish to originate.\n\nIf the underwriter is not satisfied with the documentation provided by the borrower, additional documentation and conditions may be imposed, called stipulations. The meeting of such conditions can be a daunting experience for the consumer, but it is crucial for the lending institution to ensure the information being submitted is accurate and meets specific guidelines. This is done to give the lender a reasonable guarantee that the borrower can and will repay the loan. If a third party is involved in the loan, it will help the borrower to clear such conditions.\n\nThe following documents are typically required for traditional underwriter review. Over the past several years, use of \"automated underwriting\" statistical models has reduced the amount of documentation required from many borrowers. Such automated underwriting engines include Freddie Mac's \"Loan Prospector\" and Fannie Mae's \"Desktop Underwriter\". For borrowers who have excellent credit and very acceptable debt positions, there may be virtually no documentation of income or assets required at all.\nMany of these documents are also not required for no-doc and low-doc loans.\n\n- Credit Report\n- 1003 - Uniform Residential Loan Application\n- 1004 - Uniform Residential Appraisal Report\n- 1005 - Verification Of Employment (VOE)\n- 1006 - Verification Of Deposit (VOD)\n- 1007 - Single Family Comparable Rent Schedule\n- 1008 - Transmittal Summary\n- Copy of deed of current home\n- Federal income tax records for last two years\n- Verification of Mortgage (VOM) or Verification of Payment (VOP)\n- Borrower's Authorization\n- Purchase Sales Agreement\n- 1084A and 1084B (Self-Employed Income Analysis) and 1088 \n\nAn option ARM provides the option to pay as little as the equivalent of an amortized payment based on a 1% interest rate.  As a result, the difference between the monthly payment and the interest on the loan is added to the loan principal; the loan at this point has negative amortization. In this respect, an option ARM provides a form of equity withdrawal (as in a cash-out refinancing) but over a period of time.\n\nThe option ARM gives a number of payment choices each month (for example, the equivalent of an amortized payment where the interest rate 1%, interest only based on actual interest rate, actual 30 year amortized payment, actual 15 year amortized payment). The interest rate may adjust every month in accordance with the index to which the loan is tied and the terms of the specific loan. These loans may be useful for people who have a lot of equity in their home and want to lower monthly costs; for investors, allowing them the flexibility to choose which payment to make every month; or for those with irregular incomes (such as those working on commission or for whom bonuses comprise a large portion of income).\n\nOne of the important features of this type of loan is that the minimum payments are often fixed for each year for an initial term of up to 5 years. The minimum payment may rise each year a little (payment size increases of 7.5% are common) but remain the same for another year. The interest rate may fluctuate each month, which means that the extent of any negative amortization cannot be predicted beyond worst-case scenario as dictated by the terms of the loan.\n\nLenders may charge various fees when giving a mortgage to a mortgagor. These include entry fees, exit fees, administration fees and lenders mortgage insurance. There are also settlement fees (closing costs) the settlement company will charge. In addition, if a third party handles the loan, it may charge other fees as well.\n\nThe Sharia law of Islam prohibits the payment or receipt of interest, which means that practicing Muslims cannot use conventional mortgages. However, real estate is far too expensive for most people to buy outright using cash: Islamic mortgages solve this problem by having the property change hands twice. In one variation, the bank will buy the house outright and then act as a landlord. The homebuyer, in addition to paying rent, will pay a contribution towards the purchase of the property. When the last payment is made, the property changes hands.\n\nTypically, this may lead to a higher final price for the buyers. This is because in some countries such as the United Kingdom and India there is a Stamp Duty which is a tax charged by the government on a change of ownership. Because ownership changes twice in an Islamic mortgage, a stamp tax may be charged twice. Many other jurisdictions have similar transaction taxes on change of ownership which may be levied. In the United Kingdom, the dual application of Stamp Duty in such transactions was removed in the Finance Act 2003 in order to facilitate Islamic mortgages.\n\nAn alternative scheme involves the bank reselling the property according to an installment plan, at a price higher than the original price.\nAll of these methods are still compensating the lender as if they were charging interest, but the loans are structured in a way that in name they are not, but they share the financial risks involved in the transaction with the homebuyer.",
			"DisplayFolderInfo": "{\"name\":\"Product\",\"colorCode\":\"#0E3D73\"}",
			"PrimaryKeys": "ProductId",
			"spark.sql.sources.provider": "csv"
		},
		"Retention": 0,
		"Temporary": false,
		"IsRewriteEnabled": false
	},
	"type": "TABLE"
}